{
  "$description": "| What does this do? | Leverages the default Security Baseline in the Intune admin center for Windows 10 and greater device configuration settings. This policy applies to all devices in the Azure AD group \"Baseline - Corporate Devices\". |\n| Why should you use this? | This ensures your managed devices meet the recommended security settings for Windows devics. |\n| What is the end-user impact? | Users will experience the security configurations as defined in the policy. Changes may be required depending on the organization. |\n| Learn more | [Security Baseline Profiles in Intune](https://learn.microsoft.com/en-us/mem/intune/protect/security-baselines-configure#create-the-profile) |",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
      }
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ],
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths",
      "implementationId": "deviceConfiguration--hardenedUncPathEnabled",
      "valueJson": "{\"$implementationId\":\"deviceConfiguration--hardenedUncPathEnabled\",\"hardenedUncPaths\":[{\"serverPath\":\"\\\\\\\\*\\\\SYSVOL\",\"securityFlags\":[\"requireMutualAuthentication\",\"requireIntegrity\"]},{\"serverPath\":\"\\\\\\\\*\\\\NETLOGON\",\"securityFlags\":[\"requireMutualAuthentication\",\"requireIntegrity\"]}]}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteAssistanceSolicitedSetting",
      "implementationId": "deviceConfiguration--remoteAssistanceSolicitedSettingDisabled",
      "valueJson": "{\"$implementationId\":\"deviceConfiguration--remoteAssistanceSolicitedSettingDisabled\"}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationBySetupClasses",
      "implementationId": "deviceConfiguration--hardwareDeviceInstallationBlocked",
      "valueJson": "{\"$implementationId\":\"deviceConfiguration--hardwareDeviceInstallationBlocked\",\"removeMatchingHardwareDevices\":true,\"identifiers\":[\"{d48179be-ec20-11d1-b6b8-00c04fa372a7}\"]}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanScriptsLoadedInInternetExplorer",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardEnableVirtualizationBasedSecurity",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowUIAccessApplicationsForSecureLocations",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockRemoteLogonWithBlankPassword",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientDigitallySignCommunicationsAlways",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableServerDigitallySignCommunicationsAlways",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalMode",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalModeForAdministrators",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenBlockOverrideForFiles",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenEnableInShell",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAllowUserControlOverInstall",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAlwaysInstallWithElevatedPrivileges",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_dataProtectionBlockDirectMemoryAccess",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireBehaviorMonitoring",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireCloudProtection",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanArchiveFiles",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanIncomingMail",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanNetworkFiles",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeBlockPasswordManager",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgePreventCertificateErrorOverride",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeRequireSmartScreen",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_gameDvrBlocked",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetSharingBlocked",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenBlockToastNotifications",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordBlockSimple",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordRequired",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_searchDisableIndexingEncryptedItems",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverride",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverrideForFiles",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_wiFiBlockAutomaticConnectHotspots",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockConsumerSpecificFeatures",
      "value": false,
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlocked",
      "value": true,
      "valueJson": "true"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockThirdPartyNotifications",
      "value": false,
      "valueJson": "false"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEncryptionSupport",
      "valueJson": "[\"tls11\",\"tls12\"]"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
      "valueJson": "{\"requireEncryptionForWriteAccess\":true}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomain",
      "valueJson": "{\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivate",
      "valueJson": "{\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic",
      "valueJson": "{\"connectionSecurityRulesFromGroupPolicyNotMerged\":true,\"policyRulesFromGroupPolicyNotMerged\":true,\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\"}"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceApplicationLogMaximumFileSizeInKb",
      "value": 32768,
      "valueJson": "32768"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSecurityLogMaximumFileSizeInKb",
      "value": 196608,
      "valueJson": "196608"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSystemLogMaximumFileSizeInKb",
      "value": 32768,
      "valueJson": "32768"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMachineInactivityLimit",
      "value": 15,
      "valueJson": "15"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderSignatureUpdateIntervalInHours",
      "value": 4,
      "valueJson": "4"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordExpirationDays",
      "value": 60,
      "valueJson": "60"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumAgeInDays",
      "value": 1,
      "valueJson": "1"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumCharacterSetCount",
      "value": 3,
      "valueJson": "3"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumLength",
      "value": 8,
      "valueJson": "8"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordPreviousPasswordBlockCount",
      "value": 24,
      "valueJson": "24"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordSignInFailureCountBeforeFactoryReset",
      "value": 10,
      "valueJson": "10"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityDownloadingOfPrintDriversOverHttp",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityInternetDownloadForWebPublishingAndOnlineOrderingWizards",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_credentialsUIEnumerateAdministrators",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderNetworkProtectionType",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLaunchSystemGuard",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
      "value": "enableWithUEFILock",
      "valueJson": "\"enableWithUEFILock\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardSecureBootWithDMA",
      "value": "withoutDMA",
      "valueJson": "\"withoutDMA\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_dmaGuardDeviceEnumerationPolicy",
      "value": "blockAll",
      "valueJson": "\"blockAll\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerDataExecutionPrevention",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_explorerHeapTerminationOnCorruption",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel",
      "value": "lmNtlmV2AndNotLmOrNtm",
      "valueJson": "\"lmNtlmV2AndNotLmOrNtm\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAdministratorElevationPromptBehavior",
      "value": "promptForConsentOnTheSecureDesktop",
      "valueJson": "\"promptForConsentOnTheSecureDesktop\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager",
      "value": "O:BAG:BAD:(A;;RC;;;BA)",
      "valueJson": "\"O:BAG:BAD:(A;;RC;;;BA)\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients",
      "value": "ntlmV2And128BitEncryption",
      "valueJson": "\"ntlmV2And128BitEncryption\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers",
      "value": "ntlmV2And128BitEncryption",
      "valueJson": "\"ntlmV2And128BitEncryption\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsSmartCardRemovalBehavior",
      "value": "lockWorkstation",
      "valueJson": "\"lockWorkstation\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsStandardUserElevationPromptBehavior",
      "value": "automaticallyDenyElevationRequests",
      "valueJson": "\"automaticallyDenyElevationRequests\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIcmpRedirectsOverrideOspfGeneratedRoutes",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIgnoreNetBiosNameReleaseRequestsExceptFromWinsServers",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpSourceRoutingProtectionLevel",
      "value": "highestProtection",
      "valueJson": "\"highestProtection\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpV6SourceRoutingProtectionLevel",
      "value": "highestProtection",
      "valueJson": "\"highestProtection\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_powerShellShellScriptBlockLogging",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesClientConnectionEncryptionLevel",
      "value": "high",
      "valueJson": "\"high\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesDriveRedirection",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPasswordSaving",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPromptForPasswordUponConnection",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesSecureRpcCommunication",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteHostDelegationOfNonExportableCredentials",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientBasicAuthentication",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientDigestAuthentication",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientUnencryptedTraffic",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceBasicAuthentication",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceStoringRunAsCredentials",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceUnencryptedTraffic",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_rpcUnauthenticatedClientOptions",
      "value": "authenticated",
      "valueJson": "\"authenticated\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideApplyUacRestrictionsToLocalAccountsOnNetworkLogon",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1ClientDriverStartConfiguration",
      "value": "disableDriver",
      "valueJson": "\"disableDriver\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1Server",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideStructuredExceptionHandlingOverwriteProtection",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideWDigestAuthentication",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_windowsConnectionManagerConnectionToNonDomainNetworks",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditCredentialValidation",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditKerberosAuthenticationService",
      "value": "none",
      "valueJson": "\"none\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditAccountLockout",
      "value": "failure",
      "valueJson": "\"failure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditGroupMembership",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditLogon",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditOtherLogonLogoffEvents",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditSpecialLogon",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditSecurityGroupManagement",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditUserAccountManagement",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_autoPlayDefaultAutoRunBehavior",
      "value": "doNotExecute",
      "valueJson": "\"doNotExecute\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_autoPlayForNonVolumeDevices",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_autoPlayMode",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderCloudBlockLevel",
      "value": "notConfigured",
      "valueJson": "\"notConfigured\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppAction",
      "value": "block",
      "valueJson": "\"block\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanType",
      "value": "quick",
      "valueJson": "\"quick\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime",
      "value": "notConfigured",
      "valueJson": "\"notConfigured\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay",
      "value": "everyday",
      "valueJson": "\"everyday\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType",
      "value": "sendSafeSamplesAutomatically",
      "valueJson": "\"sendSafeSamplesAutomatically\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditPNPActivity",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditProcessCreation",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_inkWorkspaceAccess",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerActiveXControlsInProtectedMode",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerAutoComplete",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBlockOutdatedActiveXControls",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarnings",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarningsAboutUncommonFiles",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCertificateAddressMismatchWarning",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckServerCertificateRevocation",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckSignaturesOnDownloadedPrograms",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerCrashDetection",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDisableProcessesInEnhancedProtectedMode",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerDownloadEnclosures",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEnhancedProtectedMode",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerFallbackToSsl3",
      "value": "noSites",
      "valueJson": "\"noSites\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIgnoreCertificateErrors",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIncludeAllNetworkPaths",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAccessToDataSources",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseActiveXControls",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowVBScriptToRun",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAutomaticPromptForFileDownloads",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCopyAndPasteViaScript",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCrossSiteScriptingFilter",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDoNotRunAntimalwareAgainstActiveXControls",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDotNetFrameworkReliantComponents",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadSignedActiveXControls",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadUnsignedActiveXControls",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragAndDropOrCopyAndPasteFiles",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsAcrossWindows",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsWithinWindows",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneIncludeLocalPathWhenUploadingFilesToServer",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneJavaPermissions",
      "value": "disableJava",
      "valueJson": "\"disableJava\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLaunchApplicationsAndFilesInAnIFrame",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLessPrivilegedSites",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLoadingOfXamlFiles",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLogonOptions",
      "value": "prompt",
      "valueJson": "\"prompt\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneNavigateWindowsAndFramesAcrossDifferentDomains",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZonePopupBlocker",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneProtectedMode",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptingOfWebBrowserControls",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptInitiatedWindows",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptlets",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSecurityWarningForPotentiallyUnsafeFiles",
      "value": "prompt",
      "valueJson": "\"prompt\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSmartScreen",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUpdatesToStatusBarViaScript",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUserDataPersistence",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneDoNotRunAntimalwareAgainstActiveXControls",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneJavaPermissions",
      "value": "highSafety",
      "valueJson": "\"highSafety\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneDoNotRunAntimalwareAgainstActiveXControls",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneJavaPermissions",
      "value": "disableJava",
      "valueJson": "\"disableJava\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownInternetZoneSmartScreen",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownIntranetZoneJavaPermissions",
      "value": "disableJava",
      "valueJson": "\"disableJava\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownLocalMachineZoneJavaPermissions",
      "value": "disableJava",
      "valueJson": "\"disableJava\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneJavaPermissions",
      "value": "disableJava",
      "valueJson": "\"disableJava\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneSmartScreen",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownTrustedZoneJavaPermissions",
      "value": "disableJava",
      "valueJson": "\"disableJava\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventManagingSmartScreenFilter",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventPerUserInstallationOfActiveXControls",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesConsistentMimeHandling",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMimeSniffingSafetyFeature",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMKProtocolSecurityRestriction",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesNotificationBar",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesProtectionFromZoneElevation",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictActiveXInstall",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictFileDownload",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesScriptedWindowSecurityRestrictions",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRemoveRunThisTimeButtonForOutdatedActiveXControls",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAccessToDataSources",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneActiveScripting",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseActiveXControls",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowVBScriptToRun",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAutomaticPromptForFileDownloads",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneBinaryAndScriptBehaviors",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCopyAndPasteViaScript",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCrossSiteScriptingFilter",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDoNotRunAntimalwareAgainstActiveXControls",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDotNetFrameworkReliantComponents",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadSignedActiveXControls",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadUnsignedActiveXControls",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragAndDropOrCopyAndPasteFiles",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsAcrossWindows",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsWithinWindows",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneFileDownloads",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneIncludeLocalPathWhenUploadingFilesToServer",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneJavaPermissions",
      "value": "disableJava",
      "valueJson": "\"disableJava\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLaunchApplicationsAndFilesInAnIFrame",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLessPrivilegedSites",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLoadingOfXamlFiles",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLogonOptions",
      "value": "anonymous",
      "valueJson": "\"anonymous\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneMetaRefresh",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneNavigateWindowsAndFramesAcrossDifferentDomains",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZonePopupBlocker",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneProtectedMode",
      "value": "enable",
      "valueJson": "\"enable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunActiveXControlsAndPlugins",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptActiveXControlsMarkedSafeForScripting",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfJavaApplets",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfWebBrowserControls",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptInitiatedWindows",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptlets",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSecurityWarningForPotentiallyUnsafeFiles",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSmartScreen",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUpdatesToStatusBarViaScript",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUserDataPersistence",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecuritySettingsCheck",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecurityZonesUseOnlyMachineSettings",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerSoftwareWhenSignatureIsInvalid",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneDoNotRunAntimalwareAgainstActiveXControls",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe",
      "value": "disable",
      "valueJson": "\"disable\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneJavaPermissions",
      "value": "highSafety",
      "valueJson": "\"highSafety\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUseActiveXInstallerService",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersAddingSites",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersChangingPolicies",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenActivateAppsWithVoice",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenCamera",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_lockScreenSlideShow",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditDetailedFileShare",
      "value": "failure",
      "valueJson": "\"failure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditFileShare",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditOtherObjectAccessEvents",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditRemovableStorage",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordRequiredType",
      "value": "alphanumeric",
      "valueJson": "\"alphanumeric\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditAuthenticationPolicyChange",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditMPSSVCRuleLevelPolicyChange",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditOtherPolicyChangeEvents",
      "value": "failure",
      "valueJson": "\"failure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditPolicyChange",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhileOnBattery",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhilePluggedIn",
      "value": "enabled",
      "valueJson": "\"enabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhileOnBattery",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhilePluggedIn",
      "value": "disabled",
      "valueJson": "\"disabled\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_privilegeUseAuditSensitivePrivilegeUse",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditOtherSystemEvents",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecurityStateChange",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditSecuritySystemExtension",
      "value": "success",
      "valueJson": "\"success\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemAuditSystemIntegrity",
      "value": "successAndFailure",
      "valueJson": "\"successAndFailure\""
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
      "definitionId": "deviceConfiguration--windows10GeneralConfiguration_systemBootStartDriverInitialization",
      "value": "goodUnknownAndBadButCritical",
      "valueJson": "\"goodUnknownAndBadButCritical\""
    }
  ],
  "templateId": "034ccd46-190c-4afc-adf1-ad7cc11262eb"
}