{
    "$description": "| What does this do? | Leverages the default Security Baseline in the Intune admin center for Defender for Endpoint configuration settings. This policy applies to all devices in the Azure AD group \"Baseline - Corporate Devices\". |\n| Why should you use this? | This ensures your managed devices meet get the recommended security settings for Defender for Endpoint. |\n| What is the end-user impact? | Users will experience the security configurations as defined in the policy. Changes may be required depending on the organization. |\n| Learn more | [Security Baseline Profiles in Intune](https://learn.microsoft.com/en-us/mem/intune/protect/security-baselines-configure#create-the-profile) |",
    "assignments": [
        {
          "target": {
            "@odata.type": "#microsoft.graph.groupAssignmentTarget",
            "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
          }
        }
      ],
    "settings": [
      {
        "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationBySetupClasses",
        "implementationId": "deviceConfiguration--hardwareDeviceInstallationBlocked",
        "valueJson": "{\"$implementationId\":\"deviceConfiguration--hardwareDeviceInstallationBlocked\",\"removeMatchingHardwareDevices\":true,\"identifiers\":[\"{d48179be-ec20-11d1-b6b8-00c04fa372a7}\"]}"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerEncryptDevice",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallBlockStatefulFTP",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenBlockOverrideForFiles",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenEnableInShell",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireCloudProtection",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanDownloads",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_edgeRequireSmartScreen",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverride",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverrideForFiles",
        "value": true,
        "valueJson": "true"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy",
        "valueJson": "{\"requireEncryptionForWriteAccess\":true,\"encryptionMethod\":\"xtsAes128\"}"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy",
        "valueJson": "{\"requireEncryptionForWriteAccess\":true,\"encryptionMethod\":\"aesCbc128\"}"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerSystemDrivePolicy",
        "valueJson": "{\"startupAuthenticationRequired\":true,\"encryptionMethod\":null,\"startupAuthenticationTpmPinUsage\":\"allowed\",\"startupAuthenticationBlockWithoutTpmChip\":true,\"startupAuthenticationTpmKeyUsage\":\"required\"}"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomain",
        "valueJson": "{\"firewallEnabled\":\"allowed\",\"inboundNotificationsBlocked\":true,\"unicastResponsesToMulticastBroadcastsRequired\":true,\"policyRulesFromGroupPolicyNotMerged\":true,\"authorizedApplicationRulesFromGroupPolicyMerged\":true,\"globalPortRulesFromGroupPolicyMerged\":true,\"connectionSecurityRulesFromGroupPolicyNotMerged\":true}"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivate",
        "valueJson": "{\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"policyRulesFromGroupPolicyNotMerged\":true,\"firewallEnabled\":\"allowed\",\"incomingTrafficRequired\":true,\"unicastResponsesToMulticastBroadcastsRequired\":true,\"authorizedApplicationRulesFromGroupPolicyNotMerged\":true,\"globalPortRulesFromGroupPolicyMerged\":true,\"connectionSecurityRulesFromGroupPolicyNotMerged\":true}"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic",
        "valueJson": "{\"policyRulesFromGroupPolicyNotMerged\":true,\"inboundConnectionsBlocked\":true,\"outboundConnectionsRequired\":true,\"inboundNotificationsBlocked\":true,\"firewallEnabled\":\"allowed\",\"incomingTrafficRequired\":true,\"unicastResponsesToMulticastBroadcastsRequired\":true,\"authorizedApplicationRulesFromGroupPolicyMerged\":true,\"globalPortRulesFromGroupPolicyMerged\":true,\"connectionSecurityRulesFromGroupPolicyNotMerged\":true}"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallIdleTimeoutForSecurityAssociationInSeconds",
        "value": 300,
        "valueJson": "300"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderCloudExtendedTimeout",
        "value": 50,
        "valueJson": "50"
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "admx--microsoftedge_PreventSmartScreenPromptOverride",
        "value": "enabled",
        "valueJson": "\"enabled\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "admx--microsoftedge_PreventSmartScreenPromptOverrideForFiles",
        "value": "enabled",
        "valueJson": "\"enabled\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "admx--microsoftedge_SmartScreenEnabled",
        "value": "enabled",
        "valueJson": "\"enabled\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "admx--microsoftedgev80diff_SmartScreenPuaEnabled",
        "value": "enabled",
        "valueJson": "\"enabled\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess",
        "value": "enable",
        "valueJson": "\"enable\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderNetworkProtectionType",
        "value": "enable",
        "valueJson": "\"enable\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess",
        "value": "enable",
        "valueJson": "\"enable\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType",
        "value": "enable",
        "valueJson": "\"enable\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
        "value": "enableWithUEFILock",
        "valueJson": "\"enableWithUEFILock\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_dmaGuardDeviceEnumerationPolicy",
        "value": "blockAll",
        "valueJson": "\"blockAll\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallCertificateRevocationListCheckMethod",
        "value": "deviceDefault",
        "valueJson": "\"deviceDefault\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallPacketQueueingMethod",
        "value": "deviceDefault",
        "valueJson": "\"deviceDefault\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_firewallPreSharedKeyEncodingMethod",
        "value": "uTF8",
        "valueJson": "\"uTF8\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderCloudBlockLevel",
        "value": "high",
        "valueJson": "\"high\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppAction",
        "value": "block",
        "valueJson": "\"block\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanType",
        "value": "quick",
        "valueJson": "\"quick\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime",
        "value": "notConfigured",
        "valueJson": "\"notConfigured\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay",
        "value": "everyday",
        "valueJson": "\"everyday\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType",
        "value": "sendSafeSamplesAutomatically",
        "valueJson": "\"sendSafeSamplesAutomatically\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhileOnBattery",
        "value": "disabled",
        "valueJson": "\"disabled\""
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
        "definitionId": "deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhilePluggedIn",
        "value": "disabled",
        "valueJson": "\"disabled\""
      }
    ],
    "templateId": "2209e067-9c8c-462e-9981-5a8c79165dcc"
  }