{
  "$description": "| What does this do? | Configures the default behavior for managed client applications on unmanaged Android devices. The baseline allows data to flow between allowed applications, but prohibits users from copying or saving data outside of the application except for users in the Azure AD group \"Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations.\" |\n| Why should you use this? |  If you want to protect users' personal Android devices by preventing organization data from leaving allowed apps. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Android device users cannot copy or save data outside of your managed client applications. |\n| Learn more | [App protection policies overview](https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy) |",
  "$friendlyName": "Baseline - Protect Policy Managed Client Apps on Unmanaged Android Devices",
  "allowedAndroidDeviceModels": [],
  "allowedDataIngestionLocations": [],
  "allowedDataStorageLocations": [
    "oneDriveForBusiness",
    "sharePoint"
  ],
  "allowedInboundDataTransferSources": "allApps",
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
  "allowedOutboundDataTransferDestinations": "managedApps",
  "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
  "appActionIfAndroidDeviceModelNotAllowed": "block",
  "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
  "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfDeviceLockNotSet": "block",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "appGroupType": "selectedPublicApps",
  "approvedKeyboards": [],
  "apps": [
    {
      "id": "com.adobe.reader.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.adobe.reader"
      },
      "version": "267816930"
    },
    {
      "id": "com.adobe.reader.intune.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.adobe.reader.intune"
      },
      "version": "113579739"
    },
    {
      "id": "com.citrix.sharefile.intune.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.citrix.sharefile.intune"
      },
      "version": "547408985"
    },
    {
      "id": "com.microsoft.cortana.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.cortana"
      },
      "version": "1239242880"
    },
    {
      "id": "com.microsoft.crm.crmphone.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.crm.crmphone"
      },
      "version": "-1708416158"
    },
    {
      "id": "com.microsoft.crm.crmtablet.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.crm.crmtablet"
      },
      "version": "1872338160"
    },
    {
      "id": "com.microsoft.dynamics.invoice.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.dynamics.invoice"
      },
      "version": "1413520457"
    },
    {
      "id": "com.microsoft.emmx.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.emmx"
      },
      "version": "-725393251"
    },
    {
      "id": "com.microsoft.exchange.bookings.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.exchange.bookings"
      },
      "version": "-1296747733"
    },
    {
      "id": "com.microsoft.flow.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.flow"
      },
      "version": "-496779816"
    },
    {
      "id": "com.microsoft.intune.mam.managedbrowser.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.intune.mam.managedbrowser"
      },
      "version": "1356606505"
    },
    {
      "id": "com.microsoft.ipviewer.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.ipviewer"
      },
      "version": "522412547"
    },
    {
      "id": "com.microsoft.launcher.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.launcher"
      },
      "version": "-1429615568"
    },
    {
      "id": "com.microsoft.mobile.polymer.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.mobile.polymer"
      },
      "version": "2129189606"
    },
    {
      "id": "com.microsoft.msapps.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.msapps"
      },
      "version": "986978680"
    },
    {
      "id": "com.microsoft.o365smb.connections.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.o365smb.connections"
      },
      "version": "1379963506"
    },
    {
      "id": "com.microsoft.office.excel.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.excel"
      },
      "version": "-1789826587"
    },
    {
      "id": "com.microsoft.office.lync15.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.lync15"
      },
      "version": "-1419864878"
    },
    {
      "id": "com.microsoft.office.onenote.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.onenote"
      },
      "version": "186482170"
    },
    {
      "id": "com.microsoft.office.outlook.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.outlook"
      },
      "version": "1146701235"
    },
    {
      "id": "com.microsoft.office.powerpoint.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.powerpoint"
      },
      "version": "1411665537"
    },
    {
      "id": "com.microsoft.office.word.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.word"
      },
      "version": "2122351424"
    },
    {
      "id": "com.microsoft.planner.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.planner"
      },
      "version": "-1658524342"
    },
    {
      "id": "com.microsoft.powerbim.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.powerbim"
      },
      "version": "1564653697"
    },
    {
      "id": "com.microsoft.sharepoint.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.sharepoint"
      },
      "version": "84773357"
    },
    {
      "id": "com.microsoft.skydrive.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.skydrive"
      },
      "version": "1887770705"
    },
    {
      "id": "com.microsoft.stream.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.stream"
      },
      "version": "648128536"
    },
    {
      "id": "com.microsoft.teams.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.teams"
      },
      "version": "1900143244"
    },
    {
      "id": "com.microsoft.todos.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.todos"
      },
      "version": "1697858135"
    },
    {
      "id": "com.microsoft.workfolders.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.workfolders"
      },
      "version": "-1290240016"
    },
    {
      "id": "com.ninefolders.hd3.work.intune.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.ninefolders.hd3.work.intune"
      },
      "version": "1959187444"
    },
    {
      "id": "com.printeron.droid.phone.intune.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.printeron.droid.phone.intune"
      },
      "version": "1984547164"
    },
    {
      "id": "com.yammer.v1.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.yammer.v1"
      },
      "version": "-1248070370"
    },
    {
      "id": "ols.microsoft.com.shiftr.android",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "ols.microsoft.com.shiftr"
      },
      "version": "1462285532"
    }
  ],
  "assignments": [
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      }
    },
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Microsoft 365 Users?id}"
      }
    }
  ],
  "biometricAuthenticationBlocked": false,
  "blockAfterCompanyPortalUpdateDeferralInDays": 0,
  "blockDataIngestionIntoOrganizationDocuments": false,
  "connectToVpnOnLaunch": false,
  "contactSyncBlocked": false,
  "dataBackupBlocked": true,
  "description": "| What does this do? | Configures the default behavior for managed client applications on unmanaged Android devices. The baseline allows data to flow between allowed applications, but prohibits users from copying or saving data outside of the application except for users in the Azure AD group \"Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations.\" |\n| Why should you use this? |  If you want to protect users' personal Android devices by preventing organization data from leaving allowed apps. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Android device users cannot copy or save data outside of your managed client applications. |\n| Learn more | [App protection policies overview](https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy) |",
  "deviceComplianceRequired": true,
  "deviceLockRequired": false,
  "dialerRestrictionLevel": "allApps",
  "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
  "disableAppPinIfDevicePinIsSet": false,
  "encryptAppData": true,
  "exemptedAppPackages": [],
  "expand": "apps,assignments",
  "fingerprintBlocked": false,
  "keyboardsRestricted": false,
  "managedBrowser": "notConfigured",
  "managedBrowserToOpenLinksRequired": false,
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "maximumPinRetries": 5,
  "minimumPinLength": 6,
  "minimumRequiredPatchVersion": "0000-00-00",
  "minimumWarningPatchVersion": "0000-00-00",
  "minimumWipePatchVersion": "0000-00-00",
  "mobileThreatDefenseRemediationAction": "block",
  "notificationRestriction": "allow",
  "organizationalCredentialsRequired": false,
  "periodBeforePinReset": "PT0S",
  "periodOfflineBeforeAccessCheck": "PT12H",
  "periodOfflineBeforeWipeIsEnforced": "P60D",
  "periodOnlineBeforeAccessCheck": "PT4H",
  "pinCharacterSet": "alphanumericAndSymbol",
  "pinRequired": true,
  "pinRequiredInsteadOfBiometricTimeout": "PT4H",
  "previousPinBlockCount": 0,
  "printBlocked": true,
  "protectedMessagingRedirectAppType": "anyApp",
  "requireClass3Biometrics": false,
  "requiredAndroidSafetyNetAppsVerificationType": "none",
  "requiredAndroidSafetyNetDeviceAttestationType": "none",
  "requiredAndroidSafetyNetEvaluationType": "basic",
  "requirePinAfterBiometricChange": false,
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "saveAsBlocked": true,
  "screenCaptureBlocked": true,
  "simplePinBlocked": false,
  "targetedAppManagementLevels": "unmanaged",
  "warnAfterCompanyPortalUpdateDeferralInDays": 0,
  "wipeAfterCompanyPortalUpdateDeferralInDays": 0
}
