{
  "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
  "$description": "| What does this do? | Defines compliance requirements and enforces a minimum operating system version for macOS devices. | Why should you use this? | This should be periodically updated so the latest release, or the previous release, of operating systems are used. Mandating up-to-date devices helps ensure that only secure, supported versions are used to access organizational resources, reducing risk from vulnerabilities. | What is the end-user impact? | Devices running unsupported or outdated versions of macOS may be restricted from accessing company data and may be required to update their OS to regain compliance and access.",
  "$friendlyName": "MacOS - Latest version",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "assignments": [
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none"
      }
    }
  ],
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "displayName": "MacOS - Latest version",
  "expand": "assignments,scheduledActionsForRule($expand=scheduledActionConfigurations)",
  "firewallBlockAllIncoming": false,
  "firewallEnabled": false,
  "firewallEnableStealthMode": false,
  "gatekeeperAllowedAppSource": "notConfigured",
  "osMinimumVersion": "15.4",
  "passwordBlockSimple": false,
  "passwordRequired": false,
  "passwordRequiredType": "deviceDefault",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "scheduledActionsForRule": [
    {
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationMessageCCList": [],
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000"
        }
      ]
    }
  ],
  "storageRequireEncryption": false,
  "systemIntegrityProtectionEnabled": false
}