{
  "$friendlyName": "Baseline - Corporate Devices - macOS",
  "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
  "$description": "| What does this do? | Defines the required state that a macOS device must be in to be considered compliant before accessing an organization's data. The baseline requires that a device blocks simple passwords, has firewall enabled, and storage encryption through FileVault. This policy applies to all devices in the Azure AD group \"Baseline - Corporate Devices - Apple\". |\n| Why should you use this? | This ensures your managed macOS devices meet a minimum level of security to access data. |\n| What is the end-user impact? | Users may access an organization's data only if the device meets the requirements defined in this policy. |\n| Learn more | [Use compliance policies to set rules for devices you manage with Intune](https://learn.microsoft.com/en-us/mem/intune/protect/compliance-policy-create-mac-os) |",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "assignments": [
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices - Apple?id}"
      }
    }
  ],
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "displayName": "Baseline - Corporate Devices - macOS",
  "expand": "assignments,scheduledActionsForRule($expand=scheduledActionConfigurations)",
  "firewallBlockAllIncoming": true,
  "firewallEnabled": true,
  "firewallEnableStealthMode": true,
  "gatekeeperAllowedAppSource": "notConfigured",
  "passwordBlockSimple": true,
  "passwordExpirationDays": 45,
  "passwordMinimumLength": 8,
  "passwordMinutesOfInactivityBeforeLock": 15,
  "passwordPreviousPasswordBlockCount": 5,
  "passwordRequired": true,
  "passwordRequiredType": "deviceDefault",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "scheduledActionsForRule": [
    {
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 24,
          "notificationMessageCCList": [],
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000"
        }
      ]
    }
  ],
  "storageRequireEncryption": true,
  "systemIntegrityProtectionEnabled": true
}
