{
  "$description": "| What does this do? | Defines the required state that a device (both physical and virtual) must be in to be considered compliant before accessing an organization's data. The baseline requires that a device has Microsoft Defender Antimalware configured, Bitlocker, Secure Boot, code integrity, TPM, Antivrus software, Antispyware software, and blocks simple passwords. This policy applies to all devices in the Azure AD group \"Baseline - Corporate Devices\". |\n| Why should you use this? | This ensures your managed Windows devices, both physical and virtual, meet a minimum level of security to access data. |\n| What is the end-user impact? | Users may access an organization's data only if the device meets the requiremnets outlined in the policy. |\n| Learn more | [Use compliance policies to set rules for devices you manage with Intune](https://learn.microsoft.com/en-us/mem/intune/protect/compliance-policy-create-windows) |",
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "activeFirewallRequired": true,
  "antiSpywareRequired": true,
  "antivirusRequired": true,
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
      }
    }
  ],
  "bitLockerEnabled": true,
  "codeIntegrityEnabled": true,
  "configurationManagerComplianceRequired": false,
  "defenderEnabled": true,
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "medium",
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "passwordBlockSimple": true,
  "passwordExpirationDays": 45,
  "passwordMinimumLength": 8,
  "passwordMinutesOfInactivityBeforeLock": 15,
  "passwordPreviousPasswordBlockCount": 5,
  "passwordRequired": true,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordRequiredType": "deviceDefault",
  "requireHealthyDeviceReport": false,
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ],
  "rtpEnabled": true,
  "scheduledActionsForRule": [
    {
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 24,
          "notificationMessageCCList": [],
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000"
        }
      ]
    }
  ],
  "secureBootEnabled": true,
  "signatureOutOfDate": true,
  "storageRequireEncryption": true,
  "tpmRequired": true,
  "validOperatingSystemBuildRanges": [],
  "virtualizationBasedSecurityEnabled": false
}