{
    "$description": "| What does this do? | Defines the required state that a device for an iOS/iPad device must be in to be considered compliant before accessing an organization's data. The baseline requires that a device is not jailbroken and prevents simple passwords. It also requires a managed email profile on the device and a threat protection level at or below medium. This policy applies to all devices in the Azure AD group \"Baseline - Corporate Devices - Apple\". |\n| Why should you use this? | This ensures your managed iOS/iPad devices meet a minimum level of security to access data. |\n| What is the end-user impact? | Users may access an organization's data only if the device meets the conditions specified in the policy. The user will have to choose a new password every 45 days. They will also have to set up a managed email profile if it is not already configured on the device. |\n| Learn more | [Use compliance policies to set rules for devices you manage with Intune](https://learn.microsoft.com/en-us/mem/intune/protect/compliance-policy-create-ios) |",
    "@odata.type": "#microsoft.graph.iosCompliancePolicy",
    "advancedThreatProtectionRequiredSecurityLevel": "medium",
    "assignments": [
      {
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices - Apple?$id}"
        }
      }
    ],
    "deviceThreatProtectionEnabled": true,
    "deviceThreatProtectionRequiredSecurityLevel": "medium",
    "managedEmailProfileRequired": true,
    "passcodeBlockSimple": true,
    "passcodeExpirationDays": 45,
    "passcodeMinimumLength": 8,
    "passcodeMinutesOfInactivityBeforeLock": 15,
    "passcodeMinutesOfInactivityBeforeScreenTimeout": 15,
    "passcodePreviousPasscodeBlockCount": 5,
    "passcodeRequired": true,
    "passcodeRequiredType": "alphanumeric",
    "restrictedApps": [],
    "roleScopeTagIds": [
      "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
    ],
    "scheduledActionsForRule": [
      {
        "scheduledActionConfigurations": [
          {
            "actionType": "block",
            "gracePeriodHours": 24,
            "notificationMessageCCList": [],
            "notificationTemplateId": "00000000-0000-0000-0000-000000000000"
          }
        ]
      }
    ],
    "securityBlockJailbrokenDevices": true
  }