{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "activeFirewallRequired": false,
  "antiSpywareRequired": true,
  "antivirusRequired": false,
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices - Physical"
      }
    }
  ],
  "bitLockerEnabled": true,
  "codeIntegrityEnabled": false,
  "configurationManagerComplianceRequired": false,
  "defenderEnabled": true,
  "description": "End User device compliance",
  "deviceThreatProtectionEnabled": true,
  "deviceThreatProtectionRequiredSecurityLevel": "medium",
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "passwordBlockSimple": false,
  "passwordRequired": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordRequiredType": "deviceDefault",
  "requireHealthyDeviceReport": false,
  "rtpEnabled": true,
  "scheduledActionsForRule": [
    {
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 24,
          "notificationMessageCCList": [],
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000"
        }
      ]
    }
  ],
  "secureBootEnabled": false,
  "signatureOutOfDate": false,
  "storageRequireEncryption": true,
  "tpmRequired": true,
  "validOperatingSystemBuildRanges": []
}