{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "activeFirewallRequired": false,
  "antiSpywareRequired": false,
  "antivirusRequired": false,
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "bitLockerEnabled": false,
  "codeIntegrityEnabled": false,
  "configurationManagerComplianceRequired": false,
  "defenderEnabled": true,
  "description": "What is it: Defines the required state that a device (both physical and virtual) must be in to be considered compliant and before it can access tenant data. \n Simeon Notes: This policy provides an additional layer of data protection for your Intune managed devices and applies to all devices both physical and virtual. Simeon’s baseline requires that a device have Microsoft Defender Antimalware configured. Policy applies to all devices via the Azure AD group ‘BUILTIN - Corporate Devices’. \n Learn More: https://docs.microsoft.com/en-us/mem/intune/protect/device-compliance-get-started",
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "passwordBlockSimple": false,
  "passwordRequired": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordRequiredType": "deviceDefault",
  "requireHealthyDeviceReport": false,
  "rtpEnabled": false,
  "scheduledActionsForRule": [
    {
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 24,
          "notificationMessageCCList": [],
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000"
        }
      ]
    }
  ],
  "secureBootEnabled": false,
  "signatureOutOfDate": false,
  "storageRequireEncryption": false,
  "tpmRequired": false,
  "validOperatingSystemBuildRanges": []
}