{
  "$friendlyName": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
  "$name": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
  "configurationPolicyTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}",
  "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes"
}