{
  "$friendlyName": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_securityformsettings~l_programmaticsettings_l_oomsend_v2",
  "$name": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/90316f12-246d-44c6-a767-f87692e86083--1?id}--user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_securityformsettings~l_programmaticsettings_l_oomsend_v2",
  "configurationPolicyTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/90316f12-246d-44c6-a767-f87692e86083--1?id}",
  "settingDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_security~l_securityformsettings~l_programmaticsettings_l_oomsend_v2"
}