{
  "$description": "| What does this do? | Leverages the default Security Baseline in the Intune admin center for Edge configuration settings. This policy applies to all devices in the Azure AD group \"Baseline - Corporate Devices\". |\n| Why should you use this? | This ensures your managed devices meet get the recommended security settings for Microsoft Edge. |\n| What is the end-user impact? | Users will experience the security configurations as defined in the policy. Changes may be required depending on the organization. |\n| Learn more | [Security Baseline Profiles in Intune](https://learn.microsoft.com/en-us/mem/intune/protect/security-baselines-configure#create-the-profile) |",
  "assignments": [
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?id}"
      }
    }
  ],
  "expand": "assignments,settings",
  "platforms": "windows10",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "settings": [
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~passwordmanager_passwordmanagerenabled?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~passwordmanager_passwordmanagerenabled_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~passwordmanager_passwordmanagerenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~passwordmanager_passwordmanagerenabled?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev107~policy~microsoft_edge_websqlaccess?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge_edgeenhanceimagesenabled?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "039c6516-8c69-4305-b20e-da55e79cccd2",
                  "useTemplateDefault": false
                },
                "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslversionmin_sslversionmin_tls1.2"
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslversionmin_sslversionmin",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "476121f9-6568-44a8-8bf8-e2f6e1de7747"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslversionmin?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslversionmin_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslversionmin",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslversionmin?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_extensioninstallblocklistdesc",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "16c2630d-c47f-4b7e-a544-227cc3cc108f"
              },
              "simpleSettingCollectionValue": [
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "value": "*"
                }
              ]
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist?settingInstanceTemplateId}"
        }
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_authschemes",
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "17976a48-8ebb-4937-9171-01da0119be9e"
              },
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "afb5ebb3-5ed9-4b9b-b790-f96c55976988",
                  "useTemplateDefault": false
                },
                "value": "ntlm,negotiate"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes?choiceSettingValueTemplate.settingValueTemplateId}",
            "useTemplateDefault": false
          },
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_1"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates:ConfigurationSettingInstanceTemplates/${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}--device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes?settingInstanceTemplateId}"
        }
      }
    }
  ],
  "technologies": "mdm",
  "templateReference": {
    "templateFamily": "baseline",
    "templateId": "${urn:resource:MSGraph:DeviceManagement:ConfigurationPolicyTemplates/c66347b7-8325-4954-a235-3bf2233dfbfd--1?id}"
  }
}