{
  "$description": "| What does this do? | Disables or blocks the use of Internet Explorer on Windows devices. |\n| Why should you use this? | Prevents use of an outdated and insecure browser within the organization. |\n| What is the end-user impact? | Users cannot launch or use Internet Explorer. |",
  "$friendlyName": "Disable Internet Explorer",
  "assignments": [
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none"
      }
    }
  ],
  "description": "",
  "expand": "assignments,settings",
  "platforms": "windows10",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "settings": [
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp_0"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp"
      }
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "user_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp_0"
        },
        "settingDefinitionId": "user_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp"
      }
    }
  ],
  "technologies": "mdm",
  "templateReference": {
    "templateFamily": "none",
    "templateId": ""
  }
}