{
  "$description": "| What does this do? | Configures OneDrive's Known Folders Move, which moves the directories Desktop, Documents, and Pictures to OneDrive and disables the option to opt out of the feature. |\n| Why should you use this? | When configured this way, OneDrive backs up user data and enables access from any device. |\n| What is the end-user impact? | Users may continue using familiar folders while being backed up. |\n| Learn more | [Redirect and move Windows known folders to OneDrive](https://docs.microsoft.com/en-us/onedrive/redirect-known-folders) |",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
      }
    }
  ],
  "definitionValues": [
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\OneDrive",
        "classType": "machine",
        "displayName": "Prevent users from redirecting their Windows known folders to their PC",
        "version": "1.0"
      },
      "enabled": true,
      "presentationValues": []
    },
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\OneDrive",
        "classType": "machine",
        "displayName": "Prompt users to move Windows known folders to OneDrive ",
        "version": "1.0"
      },
      "enabled": true,
      "presentationValues": [
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "presentation": {
            "label": "Tenant ID:"
          },
          "value": "${ResourceContext:TenantId}"
        }
      ]
    },
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\OneDrive",
        "classType": "machine",
        "displayName": "Silently move Windows known folders to OneDrive",
        "version": "2.0"
      },
      "enabled": true,
      "presentationValues": [
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "presentation": {
            "label": "Show notification to users after folders have been redirected:"
          },
          "value": "1"
        },
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "presentation": {
            "label": "Tenant ID:"
          },
          "value": "${ResourceContext:TenantId}"
        }
      ]
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ]
}