{
  "$description": "| What does this do? | Configures Microsoft Edge for all devices to automatically sign in to the browser and synchronize history and passwords. Also sets Google as the default search engine. |\n| Why should you use this? | If you want to create an optimal user experience for the new Chromium Edge browser. |\n| What is the end-user impact? | Users' search history and passwords will be synchronized across devices. |\n| Learn more | [Microsoft Edge Enterprise Sync](https://docs.microsoft.com/en-us/deployedge/microsoft-edge-enterprise-sync) |",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
      }
    }
  ],
  "definitionValues": [
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\Google\\Google Chrome\\Allow or deny screen capture",
        "classType": "user",
        "displayName": "Allow Desktop, Window, and Tab capture by these origins",
        "version": "1.0"
      },
      "enabled": false,
      "presentationValues": []
    },
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\Microsoft Edge",
        "classType": "machine",
        "displayName": "Browser sign-in settings",
        "version": "1"
      },
      "enabled": true,
      "presentationValues": [
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "presentation": {
            "label": "Browser sign-in settings"
          },
          "value": "2"
        }
      ]
    },
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\Microsoft Edge\\Default search provider",
        "classType": "machine",
        "displayName": "Default search provider name",
        "version": "1"
      },
      "enabled": true,
      "presentationValues": [
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "presentation": {
            "label": "Default search provider name"
          },
          "value": "Google"
        }
      ]
    },
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\Microsoft Edge\\Default search provider",
        "classType": "machine",
        "displayName": "Default search provider search URL",
        "version": "1"
      },
      "enabled": true,
      "presentationValues": [
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "presentation": {
            "label": "Default search provider search URL"
          },
          "value": "{google:baseURL}search?q={searchTerms}&{google:RLZ}{google:originalQueryForSuggestion}{google:assistedQueryStats}{google:searchFieldtrialParameter}{google:searchClient}{google:sourceId}ie={inputEncoding}"
        }
      ]
    },
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\Microsoft Edge\\Default search provider",
        "classType": "machine",
        "displayName": "Default search provider URL for suggestions",
        "version": "1"
      },
      "enabled": true,
      "presentationValues": [
        {
          "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
          "presentation": {
            "label": "Default search provider URL for suggestions"
          },
          "value": "{google:baseURL}complete/search?output=chrome&q={searchTerms}"
        }
      ]
    },
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\Microsoft Edge\\Default search provider",
        "classType": "machine",
        "displayName": "Enable the default search provider",
        "version": "1"
      },
      "enabled": true,
      "presentationValues": []
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ]
}