{
  "$description": "| What does this do? | The baseline turns off LinkedIn features in Office applications. By default, this setting is turned on. |\n| Why should you use this? | You can turn off Office LinkedIn features so that your users are not sharing data externally with LinkedIn. |\n| What is the end-user impact? | Users will not be able to use the LinkedIn Office features. |\n| Learn more | [Integrate LinkedIn account connections in Azure Active Directory](https://docs.microsoft.com/en-us/azure/active-directory/users-groups-roles/linkedin-integration) |",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ],
  "definitionValues": [
    {
      "@odata.type": "microsoft.graph.groupPolicyDefinitionValue",
      "configurationType": "policy",
      "definition": {
        "categoryPath": "\\Microsoft Office 2016\\Miscellaneous",
        "classType": "user",
        "displayName": "Show LinkedIn features in Office applications",
        "version": "1.0"
      },
      "enabled": false,
      "presentationValues": []
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ]
}