{
  "$friendlyName": "Baseline - Defender for Endpoint",
  "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
  "$name": "#microsoft.graph.deviceManagementStringSettingInstance--deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "value": "sendSafeSamplesAutomatically",
  "valueJson": "\"sendSafeSamplesAutomatically\""
}
