{
  "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
  "$name": "#microsoft.graph.deviceManagementBooleanSettingInstance--deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": true,
  "valueJson": "true",
  "$friendlyName": "Baseline - Windows"
}
