{
  "@odata.type": "#microsoft.graph.deviceManagementCollectionSettingInstance",
  "$name": "#microsoft.graph.deviceManagementCollectionSettingInstance--deviceConfiguration--windows10GeneralConfiguration_internetExplorerEncryptionSupport--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerEncryptionSupport",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "valueJson": "[\"tls11\",\"tls12\"]",
  "$friendlyName": "Baseline - Windows"
}
