{
  "@odata.type": "#microsoft.graph.deviceManagementComplexSettingInstance",
  "$friendlyName": "Baseline - Defender for Endpoint",
  "$name": "#microsoft.graph.deviceManagementComplexSettingInstance--deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerFixedDrivePolicy",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "valueJson": "\\{\"requireEncryptionForWriteAccess\":true,\"encryptionMethod\":\"xtsAes128\"\\}"
}
