{
  "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
  "$name": "#microsoft.graph.deviceManagementBooleanSettingInstance--deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "value": true,
  "valueJson": "true",
  "$friendlyName": "Baseline - Defender for Endpoint"
}
