{
  "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
  "$name": "#microsoft.graph.deviceManagementBooleanSettingInstance--deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAllowUserControlOverInstall--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAllowUserControlOverInstall",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": true,
  "valueJson": "true"
}