{
  "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
  "$friendlyName": "Baseline - Windows--deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel",
  "$name": "#microsoft.graph.deviceManagementStringSettingInstance--deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": "lmNtlmV2AndNotLmOrNtm",
  "valueJson": "\"lmNtlmV2AndNotLmOrNtm\""
}
