{
  "@odata.type": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance",
  "$name": "#microsoft.graph.deviceManagementAbstractComplexSettingInstance--deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "implementationId": "deviceConfiguration--hardenedUncPathEnabled",
  "valueJson": "{\"$implementationId\":\"deviceConfiguration--hardenedUncPathEnabled\",\"hardenedUncPaths\":[{\"serverPath\":\"\\\\\\\\*\\\\SYSVOL\",\"securityFlags\":[\"requireMutualAuthentication\",\"requireIntegrity\"]},{\"serverPath\":\"\\\\\\\\*\\\\NETLOGON\",\"securityFlags\":[\"requireMutualAuthentication\",\"requireIntegrity\"]}]}"
}