{
  "$friendlyName": "Baseline - Windows",
  "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
  "$name": "#microsoft.graph.deviceManagementIntegerSettingInstance--deviceConfiguration--windows10GeneralConfiguration_passwordExpirationDays--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordExpirationDays",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": 60,
  "valueJson": "60"
}
