{
  "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
  "$friendlyName": "Baseline - Defender for Endpoint--deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
  "$name": "#microsoft.graph.deviceManagementBooleanSettingInstance--deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "value": true,
  "valueJson": "true"
}
