{
  "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
  "$name": "#microsoft.graph.deviceManagementStringSettingInstance--deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": "everyday",
  "valueJson": "\"everyday\"",
  "$friendlyName": "Baseline - Windows"
}
