{
  "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
  "$friendlyName": "Baseline - Windows",
  "$name": "#microsoft.graph.deviceManagementIntegerSettingInstance--deviceConfiguration--windows10GeneralConfiguration_passwordMinimumCharacterSetCount--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumCharacterSetCount",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": 3,
  "valueJson": "3"
}
