{
  "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
  "$name": "#microsoft.graph.deviceManagementBooleanSettingInstance--deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockThirdPartyNotifications--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockThirdPartyNotifications",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": false,
  "valueJson": "false",
  "$friendlyName": "Baseline - Windows"
}
