{
  "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
  "$friendlyName": "Baseline - Windows",
  "$name": "#microsoft.graph.deviceManagementStringSettingInstance--deviceConfiguration--windows10GeneralConfiguration_autoPlayDefaultAutoRunBehavior--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_autoPlayDefaultAutoRunBehavior",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": "doNotExecute",
  "valueJson": "\"doNotExecute\""
}
