{
  "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
  "$friendlyName": "Baseline - Windows--deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional",
  "$name": "#microsoft.graph.deviceManagementStringSettingInstance--deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": "enabled",
  "valueJson": "\"enabled\""
}
