{
  "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
  "$name": "#microsoft.graph.deviceManagementIntegerSettingInstance--deviceConfiguration--windows10GeneralConfiguration_passwordMinimumLength--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_passwordMinimumLength",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": 8,
  "valueJson": "8"
}