{
  "$friendlyName": "Baseline - Windows",
  "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
  "$name": "#microsoft.graph.deviceManagementStringSettingInstance--deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneJavaPermissions--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneJavaPermissions",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Windows?id}",
  "value": "disableJava",
  "valueJson": "\"disableJava\""
}
