{
  "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
  "$friendlyName": "Baseline - Defender for Endpoint--deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime",
  "$name": "#microsoft.graph.deviceManagementStringSettingInstance--deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime--${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "definitionId": "deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime",
  "deviceManagementIntent-id": "${urn:resource:MSGraph:DeviceManagement:Intents/Baseline - Defender for Endpoint?id}",
  "value": "notConfigured",
  "valueJson": "\"notConfigured\""
}
