{
  "$friendlyName": "CMTrace",
  "@odata.type": "#microsoft.graph.win32LobApp",
  "$description": "| What does this do? | CMTrace is one of the Configuration Manager tools. It allows you to view and monitor log files including the following types: Log files in Configuration Manager or Client Component Manager (CCM) format, plain ASCII or Unicode text files, such as Intune logs. |\n| Why should you use this? | CMTrace helps to analyze Intune log files by highlighting, filtering, and error lookup. |\n| What is the end-user impact? | N/A |\n| Learn more | [CMTrace](https://docs.microsoft.com/en-us/mem/configmgr/core/support/cmtrace)",
  "$manifest": {},
  "allowAvailableUninstall": false,
  "applicableArchitectures": "x86,x64",
  "detectionRules": [
    {
      "@odata.type": "#microsoft.graph.win32LobAppFileSystemDetection",
      "check32BitOn64System": true,
      "detectionType": "exists",
      "fileOrFolderName": "CMTrace.exe",
      "operator": "notConfigured",
      "path": "%ProgramData%\\Microsoft\\IntuneManagementExtension"
    }
  ],
  "developer": "",
  "displayName": "CMTrace",
  "enableFileNameBasedDetection": false,
  "enableInstallLogging": true,
  "fileName": "010",
  "installCommandLine": "cmd /c copy CMTrace.exe \"%ProgramData%\\Microsoft\\IntuneManagementExtension\"",
  "installExperience": {
    "deviceRestartBehavior": "basedOnReturnCode",
    "maxRunTimeInMinutes": 60,
    "runAsAccount": "system"
  },
  "isFeatured": false,
  "minimumSupportedOperatingSystem": {
    "v10_0": false,
    "v10_1607": true,
    "v10_1703": false,
    "v10_1709": false,
    "v10_1803": false,
    "v10_1809": false,
    "v10_1903": false,
    "v10_1909": false,
    "v10_2004": false,
    "v10_21H1": false,
    "v10_2H20": false,
    "v8_0": false,
    "v8_1": false
  },
  "minimumSupportedWindowsRelease": "1607",
  "notes": "",
  "owner": "",
  "publisher": "Microsoft",
  "relationships": [],
  "requirementRules": [],
  "returnCodes": [
    {
      "returnCode": 0,
      "type": "success"
    },
    {
      "returnCode": 1618,
      "type": "retry"
    },
    {
      "returnCode": 1641,
      "type": "hardReboot"
    },
    {
      "returnCode": 1707,
      "type": "success"
    },
    {
      "returnCode": 3010,
      "type": "softReboot"
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "setupFilePath": "Install.ps1",
  "uninstallCommandLine": "del \"%ProgramData%\\Microsoft\\IntuneManagementExtension\\CMTrace.exe\" /y"
}
