{
  "@odata.type": "#microsoft.graph.win32LobApp",
  "$description": "| What does this do? | 7-Zip is a file archiver with a high compression ratio. |\n| Why should you use this? | 7-Zip is one of the most popular, compatible and fastest file archiving software. |\n| What is the end-user impact? | Users will have 7-Zip installed on their computer. |\n| Learn more | [7-Zip](https://www.7-zip.org/)",
  "$manifest": {
    "Install.bat": "${ResourceContext:MSGraph:DeviceAppManagement:MobileApps:Install.bat}",
    "Setup.exe": "https://www.7-zip.org/a/7z2201.exe",
    "Setup-x64.exe": "https://www.7-zip.org/a/7z2201-x64.exe"
  },
  "allowAvailableUninstall": false,
  "applicableArchitectures": "x86,x64",
  "detectionRules": [
    {
      "@odata.type": "#microsoft.graph.win32LobAppFileSystemDetection",
      "check32BitOn64System": false,
      "detectionType": "exists",
      "fileOrFolderName": "Uninstall.exe",
      "operator": "notConfigured",
      "path": "%ProgramFiles%\\7-Zip\\"
    }
  ],
  "developer": "",
  "enableFileNameBasedDetection": true,
  "enableInstallLogging": true,
  "displayName": "7-Zip",
  "fileName": "011",
  "installCommandLine": "Install.bat /S",
  "installExperience": {
    "deviceRestartBehavior": "basedOnReturnCode",
    "maxRunTimeInMinutes": 60,
    "runAsAccount": "system"
  },
  "isFeatured": false,
  "minimumSupportedOperatingSystem": {
    "v10_0": false,
    "v10_1607": true,
    "v10_1703": false,
    "v10_1709": false,
    "v10_1803": false,
    "v10_1809": false,
    "v10_1903": false,
    "v10_1909": false,
    "v10_2004": false,
    "v10_21H1": false,
    "v10_2H20": false,
    "v8_0": false,
    "v8_1": false
  },
  "minimumSupportedWindowsRelease": "1607",
  "notes": "The capital /S in the install/uninstall command lines is case sensitive.",
  "owner": "",
  "publisher": "7-Zip",
  "relationships": [],
  "requirementRules": [],
  "returnCodes": [
    {
      "returnCode": 0,
      "type": "success"
    },
    {
      "returnCode": 1618,
      "type": "retry"
    },
    {
      "returnCode": 1641,
      "type": "hardReboot"
    },
    {
      "returnCode": 1707,
      "type": "success"
    },
    {
      "returnCode": 3010,
      "type": "softReboot"
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "setupFilePath": "Install.ps1",
  "uninstallCommandLine": "\"%ProgramFiles%\\7-Zip\\Uninstall.exe\" /S",
  "$friendlyName": "7-Zip"
}
