{
  "@odata.type": "#microsoft.graph.officeSuiteApp",
  "$description": "| What does this do? | Office 365 is Microsoft’s productivity suite with popular applications such as Word, Excel and PowerPoint. |\n| Why should you use this? | If you want Office 365 desktop applications to be installed on managed devices. |\n| What is the end-user impact? | Users will have Office 365 installed on their devices. |\n| Learn more | N/A",
  "assignments": [
    {
      "intent": "required",
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
      }
    }
  ],
  "autoAcceptEula": true,
  "displayName": "Office 365",
  "excludedApps": {
    "access": false,
    "bing": true,
    "excel": false,
    "groove": true,
    "infoPath": true,
    "lync": false,
    "oneDrive": false,
    "oneNote": true,
    "outlook": false,
    "powerPoint": false,
    "publisher": false,
    "sharePointDesigner": true,
    "teams": false,
    "visio": false,
    "word": false
  },
  "installProgressDisplayLevel": "none",
  "isFeatured": true,
  "localesToInstall": [],
  "notes": "",
  "officePlatformArchitecture": "x64",
  "officeSuiteAppDefaultFileFormat": "officeOpenXMLFormat",
  "productIds": [
    "o365ProPlusRetail"
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ],
  "shouldUninstallOlderVersionsOfOffice": true,
  "targetVersion": "",
  "updateChannel": "current",
  "updateVersion": "",
  "useSharedComputerActivation": false
}