{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "$description": "| What does this do? | Assigns broad population devices to a ring that installs updates after 7 days, following pilot and test deployment groups. |\n| Why should you use this? | Provides lag time for update validation and rollback in response to issues. |\n| What is the end-user impact? | Updates are delayed, reducing risk of mass issues. |\n| Learn more | [Configure Windows Update for business rings](https://learn.microsoft.com/en-us/compliance/anz/e8-patchos-configure-wufb-rings) |",
  "$friendlyName": "Broad Ring - Install updates after 7 days",
  "$name": "#microsoft.graph.windowsUpdateForBusinessConfiguration--Broad Ring - Install updates after 7 days",
  "allowWindows11Upgrade": false,
  "automaticUpdateMode": "autoInstallAtMaintenanceTime",
  "autoRestartNotificationDismissal": "notConfigured",
  "businessReadyUpdatesOnly": "userDefined",
  "deadlineForFeatureUpdatesInDays": 2,
  "deadlineForQualityUpdatesInDays": 2,
  "deadlineGracePeriodInDays": 2,
  "deliveryOptimizationMode": "userDefined",
  "description": "",
  "displayName": "Broad Ring - Install updates after 7 days",
  "driversExcluded": false,
  "featureUpdatesDeferralPeriodInDays": 60,
  "featureUpdatesPaused": false,
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackWindowInDays": 30,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "19:00:00.0000000",
    "activeHoursStart": "07:00:00.0000000"
  },
  "microsoftUpdateServiceAllowed": true,
  "postponeRebootUntilAfterDeadline": false,
  "prereleaseFeatures": "userDefined",
  "qualityUpdatesDeferralPeriodInDays": 7,
  "qualityUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "skipChecksBeforeRestart": false,
  "updateNotificationLevel": "defaultNotifications",
  "userPauseAccess": "disabled",
  "userWindowsUpdateScanAccess": "enabled"
}