{
    "$description": "| What does this do? | Defines the OS update Policy for iOS updates. You may have to modify the UTC differential depending on your time zone. The baseline notifys the users about updates and installs them during a window of 7pm to 5am during the week. This time is 12am to 5am on the weekend. Critial updates get installed immediately. The policy is installed to the \"Baseline - Corporate Devices - Apple\" Azure AD group. |\n| Why should you use this? | To ensure that devices are being patched properly in the organization.  |\n| Learn more | [Manage iOS/iPadOS software updates](https://learn.microsoft.com/en-us/mem/intune/protect/software-updates-ios#configure-the-policy) |",
    "@odata.type": "#microsoft.graph.macOSSoftwareUpdateConfiguration",
    "allOtherUpdateBehavior": "notifyOnly",
    "assignments": [
      {
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices - Apple?$id}"
        }
      }
    ],
    "configDataUpdateBehavior": "notifyOnly",
    "criticalUpdateBehavior": "installASAP",
    "customUpdateTimeWindows": [
      {
        "endDay": "friday",
        "endTime": "05:00:00",
        "startDay": "thursday",
        "startTime": "19:00:00"
      },
      {
        "endDay": "saturday",
        "endTime": "00:00:00",
        "startDay": "friday",
        "startTime": "19:00:00"
      },
      {
        "endDay": "sunday",
        "endTime": "05:00:00",
        "startDay": "saturday",
        "startTime": "00:00:00"
      },
      {
        "endDay": "thursday",
        "endTime": "05:00:00",
        "startDay": "wednesday",
        "startTime": "19:00:00"
      },
      {
        "endDay": "tuesday",
        "endTime": "05:00:00",
        "startDay": "monday",
        "startTime": "19:00:00"
      },
      {
        "endDay": "wednesday",
        "endTime": "05:00:00",
        "startDay": "tuesday",
        "startTime": "19:00:00"
      }
    ],
    "firmwareUpdateBehavior": "notifyOnly",
    "updateScheduleType": "updateDuringTimeWindows",
    "updateTimeWindowUtcOffsetInMinutes": -360
  }