{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "$description": "| What does this do? | Enables Remote Desktop access to the device for users that are members of the \"Remote Desktop Users\" local group. A separate configuration (Add-AuthenticatedUsersToRemoteDesktopUsers) adds the users to the \"Remote Desktop Users\" group. |\n| Why should you use this? | If you want to allow Remote Desktop access to managed devices. |\n| What is the end-user impact? | Users in the \"Remote Desktop Users\" local group will be able to connect to remote devices. |\n| Learn more | [Policy CSP - RemoteDesktopServices](https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotedesktopservices) |",
  "$friendlyName": "Baseline - OS - RDP Enabled",
  "displayName": "Baseline - OS - RDP Enabled",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "AllowUsersToConnectRemotely",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/AllowUsersToConnectRemotely",
      "value": "<enabled/>"
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ]
}
