{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "$description": "| What does this do? | Disables Microsoft Consumer Experiences such as Start suggestions, Membership notifications, Post-OOBE app install and redirect tiles. |\n| Why should you use this? | If you want to improve the user experience by eliminating non value-add notifications and suggestions. |\n| What is the end-user impact? | Users will not see these additional pop-ups, suggestions and notifications. |\n| Learn more | [Policy CSP - Experience](https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-experience#experience-allowwindowsconsumerfeatures) |",
  "$friendlyName": "Baseline - UX - Microsoft Consumer Experience Disabled",
  "displayName": "Baseline - UX - Microsoft Consumer Experience Disabled",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "AllowWindowsConsumerFeatures",
      "isReadOnly": false,
      "omaUri": "./Vendor/MSFT/Policy/Config/Experience/AllowWindowsConsumerFeatures",
      "value": 0
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ]
}
