{
  "$friendlyName": "Baseline - Security - NTLMv2 LAN Manager Authentication Level",
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "$description": "| What does this do? | Configures the Windows LAN Manager Authentication Level to require NTLMv2. |\n| Why should you use this? | This is recommended by Microsoft to prevent the use of insecure protocols. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Windows file sharing will not work with any devices that do not support NTLMv2. |\n| Learn more | [Network security: LAN Manager authentication level](https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level) |",
  "applicationGuardAllowFileSaveOnHost": false,
  "applicationGuardAllowPersistence": false,
  "applicationGuardAllowPrintToLocalPrinters": false,
  "applicationGuardAllowPrintToNetworkPrinters": false,
  "applicationGuardAllowPrintToPDF": false,
  "applicationGuardAllowPrintToXPS": false,
  "applicationGuardAllowVirtualGPU": false,
  "applicationGuardBlockClipboardSharing": "notConfigured",
  "applicationGuardBlockFileTransfer": "notConfigured",
  "applicationGuardBlockNonEnterpriseContent": false,
  "applicationGuardCertificateThumbprints": [],
  "applicationGuardEnabled": false,
  "applicationGuardEnabledOptions": "notConfigured",
  "applicationGuardForceAuditing": false,
  "appLockerApplicationControl": "notConfigured",
  "bitLockerAllowStandardUserEncryption": false,
  "bitLockerDisableWarningForOtherDiskEncryption": false,
  "bitLockerEnableStorageCardEncryptionOnMobile": false,
  "bitLockerEncryptDevice": false,
  "bitLockerFixedDrivePolicy": {
    "requireEncryptionForWriteAccess": false
  },
  "bitLockerRecoveryPasswordRotation": "notConfigured",
  "bitLockerRemovableDrivePolicy": {
    "blockCrossOrganizationWriteAccess": false,
    "requireEncryptionForWriteAccess": false
  },
  "bitLockerSystemDrivePolicy": {
    "prebootRecoveryEnableMessageAndUrl": false,
    "startupAuthenticationBlockWithoutTpmChip": true,
    "startupAuthenticationRequired": false,
    "startupAuthenticationTpmKeyUsage": "blocked",
    "startupAuthenticationTpmPinAndKeyUsage": "blocked",
    "startupAuthenticationTpmPinUsage": "allowed",
    "startupAuthenticationTpmUsage": "allowed"
  },
  "defenderAdditionalGuardedFolders": [],
  "defenderAdobeReaderLaunchChildProcess": "userDefined",
  "defenderAdvancedRansomewareProtectionType": "userDefined",
  "defenderAttackSurfaceReductionExcludedPaths": [],
  "defenderBlockPersistenceThroughWmiType": "userDefined",
  "defenderEmailContentExecution": "userDefined",
  "defenderEmailContentExecutionType": "userDefined",
  "defenderFileExtensionsToExclude": [],
  "defenderFilesAndFoldersToExclude": [],
  "defenderGuardedFoldersAllowedAppPaths": [],
  "defenderGuardMyFoldersType": "userDefined",
  "defenderNetworkProtectionType": "notConfigured",
  "defenderOfficeAppsExecutableContentCreationOrLaunch": "userDefined",
  "defenderOfficeAppsExecutableContentCreationOrLaunchType": "userDefined",
  "defenderOfficeAppsLaunchChildProcess": "userDefined",
  "defenderOfficeAppsLaunchChildProcessType": "userDefined",
  "defenderOfficeAppsOtherProcessInjection": "userDefined",
  "defenderOfficeAppsOtherProcessInjectionType": "userDefined",
  "defenderOfficeCommunicationAppsLaunchChildProcess": "userDefined",
  "defenderOfficeMacroCodeAllowWin32Imports": "userDefined",
  "defenderOfficeMacroCodeAllowWin32ImportsType": "userDefined",
  "defenderPreventCredentialStealingType": "userDefined",
  "defenderProcessCreation": "userDefined",
  "defenderProcessCreationType": "userDefined",
  "defenderProcessesToExclude": [],
  "defenderScriptDownloadedPayloadExecution": "userDefined",
  "defenderScriptDownloadedPayloadExecutionType": "userDefined",
  "defenderScriptObfuscatedMacroCode": "userDefined",
  "defenderScriptObfuscatedMacroCodeType": "userDefined",
  "defenderSecurityCenterBlockExploitProtectionOverride": false,
  "defenderSecurityCenterDisableSecureBootUI": false,
  "defenderSecurityCenterDisableTroubleshootingUI": false,
  "defenderSecurityCenterITContactDisplay": "notConfigured",
  "defenderSecurityCenterNotificationsFromApp": "notConfigured",
  "defenderUntrustedExecutable": "userDefined",
  "defenderUntrustedExecutableType": "userDefined",
  "defenderUntrustedUSBProcess": "userDefined",
  "defenderUntrustedUSBProcessType": "userDefined",
  "deviceGuardEnableSecureBootWithDMA": false,
  "deviceGuardEnableVirtualizationBasedSecurity": false,
  "deviceGuardLaunchSystemGuard": "notConfigured",
  "deviceGuardLocalSystemAuthorityCredentialGuardSettings": "notConfigured",
  "deviceGuardSecureBootWithDMA": "notConfigured",
  "displayName": "Baseline - Security - NTLMv2 LAN Manager Authentication Level",
  "dmaGuardDeviceEnumerationPolicy": "deviceDefault",
  "firewallCertificateRevocationListCheckMethod": "deviceDefault",
  "firewallIPSecExemptionsAllowDHCP": false,
  "firewallIPSecExemptionsAllowICMP": false,
  "firewallIPSecExemptionsAllowNeighborDiscovery": false,
  "firewallIPSecExemptionsAllowRouterDiscovery": false,
  "firewallIPSecExemptionsNone": false,
  "firewallPacketQueueingMethod": "deviceDefault",
  "firewallPreSharedKeyEncodingMethod": "deviceDefault",
  "firewallRules": [],
  "lanManagerAuthenticationLevel": "lmNtlmV2AndNotLm",
  "lanManagerWorkstationDisableInsecureGuestLogons": false,
  "localSecurityOptionsAdministratorElevationPromptBehavior": "notConfigured",
  "localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares": false,
  "localSecurityOptionsAllowPKU2UAuthenticationRequests": false,
  "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool": false,
  "localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn": false,
  "localSecurityOptionsAllowUIAccessApplicationElevation": false,
  "localSecurityOptionsAllowUIAccessApplicationsForSecureLocations": false,
  "localSecurityOptionsAllowUndockWithoutHavingToLogon": false,
  "localSecurityOptionsBlockMicrosoftAccounts": false,
  "localSecurityOptionsBlockRemoteLogonWithBlankPassword": false,
  "localSecurityOptionsBlockRemoteOpticalDriveAccess": false,
  "localSecurityOptionsBlockUsersInstallingPrinterDrivers": false,
  "localSecurityOptionsClearVirtualMemoryPageFile": false,
  "localSecurityOptionsClientDigitallySignCommunicationsAlways": false,
  "localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers": false,
  "localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation": false,
  "localSecurityOptionsDisableAdministratorAccount": false,
  "localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees": false,
  "localSecurityOptionsDisableGuestAccount": false,
  "localSecurityOptionsDisableServerDigitallySignCommunicationsAlways": false,
  "localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees": false,
  "localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts": false,
  "localSecurityOptionsDoNotRequireCtrlAltDel": false,
  "localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange": false,
  "localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser": "notConfigured",
  "localSecurityOptionsHideLastSignedInUser": false,
  "localSecurityOptionsHideUsernameAtSignIn": false,
  "localSecurityOptionsInformationDisplayedOnLockScreen": "notConfigured",
  "localSecurityOptionsInformationShownOnLockScreen": "notConfigured",
  "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients": "none",
  "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers": "none",
  "localSecurityOptionsOnlyElevateSignedExecutables": false,
  "localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares": false,
  "localSecurityOptionsSmartCardRemovalBehavior": "lockWorkstation",
  "localSecurityOptionsStandardUserElevationPromptBehavior": "notConfigured",
  "localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation": false,
  "localSecurityOptionsUseAdminApprovalMode": false,
  "localSecurityOptionsUseAdminApprovalModeForAdministrators": false,
  "localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations": false,
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "smartScreenBlockOverrideForFiles": false,
  "smartScreenEnableInShell": false,
  "windowsDefenderTamperProtection": "notConfigured",
  "xboxServicesAccessoryManagementServiceStartupMode": "manual",
  "xboxServicesEnableXboxGameSaveTask": false,
  "xboxServicesLiveAuthManagerServiceStartupMode": "manual",
  "xboxServicesLiveGameSaveServiceStartupMode": "manual",
  "xboxServicesLiveNetworkingServiceStartupMode": "manual"
}
