{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "$description": "| What does this do? | Configures URLs to include in the browser's security zones. The baseline configures the Intranet zone to include necessary Microsoft URLs for Azure Active Directory Seamless Single Sign-On. |\n| Why should you use this? | Improves your users' browsing experience by automatically logging in to sites secured by Azure AD. |\n| What is the end-user impact? | Users will be unable to configure URLs for browser security zones themselves. |\n| Learn more | [Internet Explorer security zones registry entries for advanced users](https://support.microsoft.com/en-us/help/182569/internet-explorer-security-zones-registry-entries-for-advanced-users), [Azure Active Directory Seamless Single Sign-On](https://docs.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-sso-quick-start) |",
  "$friendlyName": "Baseline - Security - IE Site-to-Zone Assignment",
  "displayName": "Baseline - Security - IE Site-to-Zone Assignment",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "AllowSiteToZoneAssignmentList",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/InternetExplorer/AllowSiteToZoneAssignmentList",
      "value": "<Enabled/><Data id=\"IZ_ZonemapPrompt\"\nValue=\"https://autologon.microsoftazuread-sso.com&#xF000;1&#xF000;https://*.blob.core.windows.net&#xF000;2&#xF000;http://*.${ResourceContext:TenantDomainName}&#xF000;1&#xF000;https://*.microsoft.com&#xF000;2&#xF000;https://*.windows.net&#xF000;2&#xF000;https://*.office365.com&#xF000;2&#xF000;https://*.${ResourceContext:TenantDomainName}&#xF000;1&#xF000;&#xF000;\"/>"
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ]
}
