{
  "$friendlyName": "Baseline - UX - Windows First Run Animation Disabled",
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "$description": "| What does this do? | Disables Windows First Run animation, which displays animation and marketing when a user first signs into Windows. |\n| Why should you use this? | If you want to eliminate marketing materials and non-essential animation during initial sign-in. |\n| What is the end-user impact? | Users may have an improved experience when opting out of First Run Animation. |\n| Learn more | [Policy CSP - WindowsLogon](https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowslogon#windowslogon-enablefirstlogonanimation) |",
  "displayName": "Baseline - UX - Windows First Run Animation Disabled",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "DisableFirstLogonAnimation",
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsLogon/EnableFirstLogonAnimation",
      "value": 0
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ]
}
