{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "$friendlyName": "Critical Ring – Install updates after 10 days",
  "$name": "#microsoft.graph.windowsUpdateForBusinessConfiguration--Critical Ring – Install updates after 10 days",
  "allowWindows11Upgrade": false,
  "automaticUpdateMode": "autoInstallAtMaintenanceTime",
  "autoRestartNotificationDismissal": "notConfigured",
  "businessReadyUpdatesOnly": "userDefined",
  "deadlineForFeatureUpdatesInDays": 2,
  "deadlineForQualityUpdatesInDays": 2,
  "deadlineGracePeriodInDays": 2,
  "deliveryOptimizationMode": "userDefined",
  "description": "",
  "displayName": "Critical Ring – Install updates after 10 days",
  "driversExcluded": false,
  "featureUpdatesDeferralPeriodInDays": 60,
  "featureUpdatesPaused": false,
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackWindowInDays": 30,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "19:00:00.0000000",
    "activeHoursStart": "07:00:00.0000000"
  },
  "microsoftUpdateServiceAllowed": true,
  "postponeRebootUntilAfterDeadline": false,
  "prereleaseFeatures": "userDefined",
  "qualityUpdatesDeferralPeriodInDays": 7,
  "qualityUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "skipChecksBeforeRestart": false,
  "updateNotificationLevel": "defaultNotifications",
  "userPauseAccess": "disabled",
  "userWindowsUpdateScanAccess": "enabled"
}