{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "$description": "| What does this do? | Defines the Fast Ring assignment for Windows Updates. |\n| Why should you use this? | Assigns select devices to receive updates before the majority, but after Test/Pilot. |\n| What is the end-user impact? | Devices in this group may see updates sooner, and act as an additional validation tier. |\n| Learn more | [Configure Windows Update for business rings](https://learn.microsoft.com/en-us/compliance/anz/e8-patchos-configure-wufb-rings) |",  
  "$friendlyName": "Fast Ring - Install updates after 4 days",
  "$name": "#microsoft.graph.windowsUpdateForBusinessConfiguration--Fast Ring - Install updates after 4 days",
  "allowWindows11Upgrade": false,
  "automaticUpdateMode": "autoInstallAtMaintenanceTime",
  "autoRestartNotificationDismissal": "notConfigured",
  "businessReadyUpdatesOnly": "userDefined",
  "deadlineForFeatureUpdatesInDays": 2,
  "deadlineForQualityUpdatesInDays": 2,
  "deadlineGracePeriodInDays": 2,
  "deliveryOptimizationMode": "userDefined",
  "description": "",
  "displayName": "Fast Ring - Install updates after 4 days",
  "driversExcluded": false,
  "featureUpdatesDeferralPeriodInDays": 30,
  "featureUpdatesPaused": false,
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackWindowInDays": 30,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "19:00:00.0000000",
    "activeHoursStart": "07:00:00.0000000"
  },
  "microsoftUpdateServiceAllowed": true,
  "postponeRebootUntilAfterDeadline": false,
  "prereleaseFeatures": "userDefined",
  "qualityUpdatesDeferralPeriodInDays": 4,
  "qualityUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "skipChecksBeforeRestart": false,
  "updateNotificationLevel": "defaultNotifications",
  "userPauseAccess": "disabled",
  "userWindowsUpdateScanAccess": "enabled"
}