{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "$description": "| What does this do? | Creates a Windows Update configuration for managed devices in the \"Preview\" ring, which receive updates after \"Insiders\" but before devices with the default policy. The baseline delays feature and quality updates to the \"Preview\" group for 7 days after released by Microsoft. Once the deferral period has expired for a device, users have 3 days to restart (if required). Unattended updates will only be applied outside working hours of 5am to 10pm. Applies to users in the Azure AD group \"Baseline - Corporate Devices – Preview\". |\n| Why should you use this? | A Windows update ring is the best way to ensure Windows updates are compatible in your environment by testing the update in rings of users. |\n| What is the end-user impact? | Users in the \"Preview\" ring will receive updates 7 days after being released by Microsoft and after Insiders, but before devices with the default policy. |\n| Learn more | [Tactical considerations for creating Windows deployment rings](https://techcommunity.microsoft.com/t5/windows-it-pro-blog/tactical-considerations-for-creating-windows-deployment-rings/ba-p/746979) |",
  "allowWindows11Upgrade": false,
  "automaticUpdateMode": "autoInstallAndRebootAtMaintenanceTime",
  "autoRestartNotificationDismissal": "notConfigured",
  "businessReadyUpdatesOnly": "businessReadyOnly",
  "deadlineForFeatureUpdatesInDays": 5,
  "deadlineForQualityUpdatesInDays": 3,
  "deadlineGracePeriodInDays": 1,
  "deliveryOptimizationMode": "userDefined",
  "displayName": "Baseline - OS - Preview Windows 10 Update Ring",
  "driversExcluded": false,
  "featureUpdatesDeferralPeriodInDays": 7,
  "featureUpdatesPaused": false,
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackWindowInDays": 60,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "22:00:00.0000000",
    "activeHoursStart": "05:00:00.0000000"
  },
  "microsoftUpdateServiceAllowed": true,
  "prereleaseFeatures": "userDefined",
  "qualityUpdatesDeferralPeriodInDays": 7,
  "qualityUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "scheduleImminentRestartWarningInMinutes": 60,
  "scheduleRestartWarningInHours": 8,
  "skipChecksBeforeRestart": false,
  "updateNotificationLevel": "notConfigured",
  "updateWeeks": "everyWeek",
  "userPauseAccess": "notConfigured",
  "userWindowsUpdateScanAccess": "notConfigured",
  "$friendlyName": "Baseline - OS - Preview Windows 10 Update Ring"
}
