{
  "$description": "| What does this do? | Enables Azure AD users to reset their passwords from the Windows login screen. |\n| Why should you use this? | If you want to allow users to reset their passwords from the Windows login screen. |\n| What is the end-user impact? | Users may reset their passwords from the Windows login screen. |\n| Learn more | [Enable Azure Active Directory self-service password reset at the Windows sign-in screen](https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-sspr-windows) |",
  "$friendlyName": "Baseline - Security - Password Reset Enabled",
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "displayName": "Baseline - Security - Password Reset Enabled",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "AllowAadPasswordReset",
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Authentication/AllowAadPasswordReset",
      "value": 1
    }
  ],
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ]
}
