{
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ],
  "description": "#### **What does this do?**\n\nBlocks simple passwords including picture passwords.\n\n#### **Why should you use this?**\n\nIf you want to increase security by blocking simple passwords. \n\n#### **What is the end-user impact?**\n\nUsers are restricted from creating simple passwords. \n\n#### **Learn more**\n\n[Eliminate bad passwords using Azure Active Directory Password Protection](https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-password-ban-bad)",
  "passwordBlockSimple": true,
  "passwordRequired": true
}
