{
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "$description": "| What does this do? | Blocks simple passwords including picture passwords. |\n| Why should you use this? | If you want to increase security by blocking simple passwords. |\n| What is the end-user impact? | Users are restricted from creating simple passwords. |\n| Learn more | [Eliminate bad passwords using Azure Active Directory Password Protection](https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-password-ban-bad) |",
  "assignments": [
    {
      "intent": "apply",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "intent": "apply",
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ]
}