{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "Baseline - Corporate Devices"
      }
    }
  ],
  "description": "| What does this do? | Configures the Windows LAN Manager Authentication Level to require NTLMv2. |\n| Why should you use this? | This is recommended by Microsoft to prevent the use of insecure protocols. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Windows file sharing will not work with any devices that do not support NTLMv2. |\n| Learn more | [Network security: LAN Manager authentication level](https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level) |",
  "lanManagerAuthenticationLevel": "lmNtlmV2AndNotLm"
}