{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "Baseline - Corporate Devices"
      }
    }
  ],
  "description": "**What does this do?**\n\nEnables Remote Desktop access to the device for users that are members of the 'Remote Desktop Users' local group. A separate configuration (Add-AuthenticatedUsersToRemoteDesktopUsers) adds the users to the 'Remote Desktop Users' group. \n\n**Why should you use this?**\n\n If you want to allow Remote Desktop access to the device.\n\n**What is the end-user impact?**\n\nUsers in the 'Remote Desktop Users' local group will be able to connect to remote devices. \n\n**Learn more**\n\n[Policy CSP - RemoteDesktopServices](https://docs.microsoft.com/en-us/windows/client-management/mdm/policy-csp-remotedesktopservices)",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "AllowUsersToConnectRemotely",
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/RemoteDesktopServices/AllowUsersToConnectRemotely",
      "value": "<enabled/>"
    }
  ]
}