{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "Baseline - Corporate Devices"
      }
    }
  ],
  "description": "| What does this do? | Enables Azure AD users to reset their passwords from the Windows login screen. |\n| Why should you use this? | If you want to allow users to reset their passwords from the Windows login screen. |\n| What is the end-user impact? | Users may reset their passwords from the Windows login screen. |\n| Learn more | [Enable Azure Active Directory self-service password reset at the Windows sign-in screen](https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-sspr-windows) |",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "AllowAadPasswordReset",
      "isEncrypted": false,
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Authentication/AllowAadPasswordReset",
      "value": 1
    }
  ]
}