{
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "Baseline - Corporate Devices"
      }
    }
  ],
  "description": "| What does this do? | Limits applications available for download in the Microsoft Store via the 'Private Store' functionality. This policy allows you to restrict your users to only those applications that you deem necessary. |\n| Why should you use this? | If you want to limit the applications which users may download to those in your private store. |\n| What is the end-user impact? | Users may only use apps that you deem necessary. |\n| Learn more | [Distribute apps using your private store](https://docs.microsoft.com/en-us/microsoft-store/distribute-apps-from-your-private-store) |",
  "windowsStoreEnablePrivateStoreOnly": true
}