{
  "@odata.type": "#microsoft.graph.windowsIdentityProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ],
  "description": "**What does this do?**\n\nDisables Windows Hello, a biometric sign-in system for Windows 10 that uses a near infrared (IR) imaging camera or fingerprint reader instead of a password to identify users.\n\n**Why should you use this?**\n\nIf you want to disable Windows Hello and instead use passwords which are more in line with industry best practices.  \n\n**What is the end-user impact?**\n\nUsers will not be prompted to sign in with a biometric system.\n\n**Learn more**\n\nN/A",
  "windowsHelloForBusinessBlocked": true
}