{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "Baseline - Corporate Devices - Physical"
      }
    }
  ],
  "bitLockerAllowStandardUserEncryption": true,
  "bitLockerDisableWarningForOtherDiskEncryption": true,
  "bitLockerEnableStorageCardEncryptionOnMobile": true,
  "bitLockerEncryptDevice": true,
  "bitLockerFixedDrivePolicy": {
    "recoveryOptions": {
      "blockDataRecoveryAgent": false,
      "enableBitLockerAfterRecoveryInformationToStore": true,
      "enableRecoveryInformationSaveToStore": true,
      "hideRecoveryOptions": true,
      "recoveryInformationToStore": "passwordAndKey",
      "recoveryKeyUsage": "allowed",
      "recoveryPasswordUsage": "allowed"
    },
    "requireEncryptionForWriteAccess": true
  },
  "bitLockerRemovableDrivePolicy": {
    "requireEncryptionForWriteAccess": true
  },
  "bitLockerSystemDrivePolicy": {
    "prebootRecoveryEnableMessageAndUrl": true,
    "recoveryOptions": {
      "blockDataRecoveryAgent": false,
      "enableBitLockerAfterRecoveryInformationToStore": true,
      "enableRecoveryInformationSaveToStore": true,
      "hideRecoveryOptions": true,
      "recoveryInformationToStore": "passwordAndKey",
      "recoveryKeyUsage": "allowed",
      "recoveryPasswordUsage": "allowed"
    },
    "startupAuthenticationBlockWithoutTpmChip": true,
    "startupAuthenticationRequired": true,
    "startupAuthenticationTpmPinUsage": "allowed",
    "startupAuthenticationTpmUsage": "allowed"
  },
  "description": "| What does this do? | Enables and configures BitLocker device encryption for physical devices. BitLocker requires a machine to have TPM 1.2 or later, which excludes older hardware and virtual machines. |\n| Why should you use this? | Device encryption is essential to protecting data on physical devices. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Data on users' hard drives are encrypted. |\n| Learn more | [Overview of BitLocker Device Encryption in Windows 10](https://docs.microsoft.com/en-us/windows/security/information-protection/bitlocker/bitlocker-device-encryption-overview-windows-10) |"
}
