{
  "@odata.type": "#microsoft.graph.windowsHealthMonitoringConfiguration",
  "$description": "",
  "allowDeviceHealthMonitoring": "enabled",
  "assignments": [
    {
      "intent": "apply",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "configDeviceHealthMonitoringScope": "bootPerformance"
}