{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices - Insiders"
      }
    }
  ],
  "automaticUpdateMode": "autoInstallAndRebootAtMaintenanceTime",
  "businessReadyUpdatesOnly": "windowsInsiderBuildSlow",
  "deadlineForFeatureUpdatesInDays": 5,
  "deadlineForQualityUpdatesInDays": 3,
  "deadlineGracePeriodInDays": 1,
  "description": "What is it: Creates a Windows Update configuration for Intune managed devices that gets updates before any other device in your tenant. \n Simeon Notes: A Windows update ring is the best way to ensure Windows updates are compatible in your environment. The insider ring is meant for users that are technical enough to understand when an update is applied and to let you know if that update caused problems. Simeon's baseline delays feature and quality updates to Insiders for 3 days after released by Microsoft. Once the deferral period has expired for the device, users have 3 days to restart (if required). Also, unattended updates are only be applied outside the working hours of 5am to 10pm. Applies to users in the Azure AD group 'BUILTIN - Corporate Devices – Insiders'. \n Learn More: https://techcommunity.microsoft.com/t5/windows-it-pro-blog/tactical-considerations-for-creating-windows-deployment-rings/ba-p/746979",
  "engagedRestartDeadlineInDays": null,
  "engagedRestartSnoozeScheduleInDays": null,
  "engagedRestartTransitionScheduleInDays": null,
  "featureUpdatesDeferralPeriodInDays": 3,
  "featureUpdatesRollbackWindowInDays": 60,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "22:00:00",
    "activeHoursStart": "05:00:00"
  },
  "microsoftUpdateServiceAllowed": true,
  "qualityUpdatesDeferralPeriodInDays": 3,
  "scheduleImminentRestartWarningInMinutes": 60,
  "scheduleRestartWarningInHours": 8,
  "updateWeeks": "everyWeek",
  "userPauseAccess": "enabled",
  "userWindowsUpdateScanAccess": "enabled"
}