{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices - Insiders"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices - Preview"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "automaticUpdateMode": "autoInstallAndRebootAtMaintenanceTime",
  "businessReadyUpdatesOnly": "businessReadyOnly",
  "deadlineForFeatureUpdatesInDays": 5,
  "deadlineForQualityUpdatesInDays": 3,
  "deadlineGracePeriodInDays": 1,
  "description": "What is it: Defines the default Windows Update configuration for Intune managed devices. Applies to all corporate devices except those in the Insiders or Preview update rings. \n Simeon Notes: This is the catch all Windows Update Ring that includes all devices not included in other rings. Simeon's baseline delays feature updates for 30 days and quality updates for 14 days after released by Microsoft. Once the deferral period has expired for the device, users have 3 days to restart (if required). Also, unattended updates are only be applied outside the working hours of 5am to 10pm. \n Learn More: https://techcommunity.microsoft.com/t5/windows-it-pro-blog/tactical-considerations-for-creating-windows-deployment-rings/ba-p/746979",
  "engagedRestartDeadlineInDays": null,
  "engagedRestartSnoozeScheduleInDays": null,
  "engagedRestartTransitionScheduleInDays": null,
  "featureUpdatesDeferralPeriodInDays": 30,
  "featureUpdatesRollbackWindowInDays": 60,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "22:00:00",
    "activeHoursStart": "05:00:00"
  },
  "microsoftUpdateServiceAllowed": true,
  "qualityUpdatesDeferralPeriodInDays": 14,
  "scheduleImminentRestartWarningInMinutes": 60,
  "scheduleRestartWarningInHours": 8,
  "updateWeeks": "everyWeek"
}