{
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices - Physical"
      }
    }
  ],
  "description": "**What does this do?**\nEnables local Autopilot Reset on Windows 10, which allows an Autopilot Reset to be initiated locally at the device itself. If you do not enable this, you can initiate a reset only from the Azure Portal. \n\n**Why should you use this?**\nIn the event that remote Autopilot Reset from the Azure Portal is not possible due to connectivity or other issues, a user may initiate an Autopilot Reset themselves to restore their device to a known good state.\n\n**What is the end-user impact?**\nUsers may initiate an Autopilot Reset themselves, which can come in handy if Autopilot Reset from the Azure Portal is not possible.\n\n**Learn more**\n[Windows Autopilot Reset](https://docs.microsoft.com/en-us/windows/deployment/windows-autopilot/windows-autopilot-reset-local)",
  "enableAutomaticRedeployment": true
}