{
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ],
  "description": "What is it: Blocks simple passwords, including picture passwords. \n Learn More: https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-password-ban-bad",
  "passwordBlockSimple": true,
  "passwordRequired": true
}
