{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "description": "What is it: Suppresses Windows Firewall alerts to the end user for Domain and Private network firewalls. \n Simeon Notes: This policy improves user experience by suppressing warnings that the Domain and Private network firewall profiles allow inbound traffic by default.",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "DisableNotifications",
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsDefenderSecurityCenter/DisableNotifications",
      "value": 1
    }
  ]
}