{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "description": "**What does this do?**\nAllows inbound connections for the Windows Firewall from the Domain and Private network profiles. This allows services such as Remote Desktop and file sharing to function. \n**Why should you use this?**\nIf you want to allow inbound network traffic by default on Domain and Private network profiles.\n**What is the end-user impact?**\n...\n**Learn more**\n[Internet Explorer security zones registry entries for advanced users](https://support.microsoft.com/en-us/help/182569/internet-explorer-security-zones-registry-entries-for-advanced-users) \n\n@metamenos should we include this? Jeff is wondering if we should exclude this because it shows that Windows defender firewall is not using the recommended settings to protect your computer",
  "firewallProfileDomain": {
    "firewallEnabled": "allowed",
    "inboundConnectionsRequired": true,
    "incomingTrafficRequired": true
  },
  "firewallProfilePrivate": {
    "firewallEnabled": "allowed",
    "inboundConnectionsRequired": true,
    "incomingTrafficRequired": true
  }
}