{
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ],
  "description": "**What does this do?**\nBlocks simple passwords including picture passwords.\n**Why should you use this?**\nIf you want to increase security by blocking simple passwords. \n**What is the end-user impact?**\nUsers are restricted from creating simple passwords. \n**Learn more**\n[Eliminate bad passwords using Azure Active Directory Password Protection](https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-password-ban-bad)",
  "passwordBlockSimple": true,
  "passwordRequired": true
}
