{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "description": "Allows inbound connections from the Windows Firewall from the Domain and Private network profiles. Allows services like RDP, file sharing, etc. to work.\n\nNote: This policy may show as not applicable on some Windows 10 devices, but it has in fact been applied successfully. It appears to be a bug in the reporting.",
  "firewallProfileDomain": {
    "firewallEnabled": "allowed",
    "inboundConnectionsRequired": true,
    "incomingTrafficRequired": true
  },
  "firewallProfilePrivate": {
    "firewallEnabled": "allowed",
    "inboundConnectionsRequired": true,
    "incomingTrafficRequired": true
  }
}