{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "description": "What is it: Configures the LAN Manager Authentication Level to NTLMv2. \n Learn More: https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level",
  "lanManagerAuthenticationLevel": "lmNtlmV2AndNotLm"
}