{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "description": "**What does this do?**\nDisables Windows Firewall alerts to the end user for Domain and Private network firewalls.\n\n**Why should you use this?**\n...\n\n**What is the end-user impact?**\n...\n\n**Learn more**\nN/A\n\n@metamenos do we want to keep this? Jeff feels like anything that's questionable, when we're going against the Microsoft recommendation, shouldn't really be in the baseline. But what're your thoughts?",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "DisableNotifications",
      "isReadOnly": false,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/WindowsDefenderSecurityCenter/DisableNotifications",
      "value": 1
    }
  ]
}