{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "description": "What is it: Allows inbound connections for the Windows Firewall from the Domain and Private network profiles. Allows services like RDP, file sharing, etc. to work. \n Simeon Notes: This policy may show as not applicable on some Windows 10 devices, but it has in fact been applied successfully due to a bug in reporting.",
  "firewallProfileDomain": {
    "firewallEnabled": "allowed",
    "inboundConnectionsRequired": true,
    "incomingTrafficRequired": true
  },
  "firewallProfilePrivate": {
    "firewallEnabled": "allowed",
    "inboundConnectionsRequired": true,
    "incomingTrafficRequired": true
  }
}