{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [],
  "description": "UAC will always prompt for credentials when elevating, even if the current user is already an admin. This adds a layer of security and servers compensating control to remove the necessity of having separate, dedicated local admin accounts for users.",
  "localSecurityOptionsAdministratorElevationPromptBehavior": "promptForCredentials",
  "localSecurityOptionsStandardUserElevationPromptBehavior": "promptForCredentials"
}