{
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ],
  "description": "Block simple passwords including picture passwords as they don't meet corporate device password policy.",
  "passwordBlockSimple": true,
  "passwordRequired": true
}
