{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices - Physical"
      }
    }
  ],
  "bitLockerAllowStandardUserEncryption": true,
  "bitLockerDisableWarningForOtherDiskEncryption": true,
  "bitLockerEnableStorageCardEncryptionOnMobile": true,
  "bitLockerEncryptDevice": true,
  "bitLockerFixedDrivePolicy": {
    "recoveryOptions": {
      "blockDataRecoveryAgent": false,
      "enableBitLockerAfterRecoveryInformationToStore": true,
      "enableRecoveryInformationSaveToStore": true,
      "hideRecoveryOptions": true,
      "recoveryInformationToStore": "passwordAndKey",
      "recoveryKeyUsage": "allowed",
      "recoveryPasswordUsage": "allowed"
    },
    "requireEncryptionForWriteAccess": true
  },
  "bitLockerRemovableDrivePolicy": {
    "blockCrossOrganizationWriteAccess": false,
    "requireEncryptionForWriteAccess": true
  },
  "bitLockerSystemDrivePolicy": {
    "prebootRecoveryEnableMessageAndUrl": true,
    "recoveryOptions": {
      "blockDataRecoveryAgent": false,
      "enableBitLockerAfterRecoveryInformationToStore": true,
      "enableRecoveryInformationSaveToStore": true,
      "hideRecoveryOptions": true,
      "recoveryInformationToStore": "passwordAndKey",
      "recoveryKeyUsage": "allowed",
      "recoveryPasswordUsage": "allowed"
    },
    "startupAuthenticationBlockWithoutTpmChip": true,
    "startupAuthenticationRequired": true,
    "startupAuthenticationTpmKeyUsage": "blocked",
    "startupAuthenticationTpmPinAndKeyUsage": "blocked",
    "startupAuthenticationTpmPinUsage": "allowed",
    "startupAuthenticationTpmUsage": "allowed"
  },
  "description": "What is it: Enables and configures BitLocker device encryption for physical devices. \n Simeon Notes: Device encryption is essential to protecting data on physical devices. Note that BitLocker requires a machine to have TPM 1.2 or later, which excludes older hardware and virtual machines. \n Learn More: https://docs.microsoft.com/en-us/windows/security/information-protection/bitlocker/bitlocker-device-encryption-overview-windows-10"
}