{
  "@odata.type": "#microsoft.graph.windowsIdentityProtectionConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    },
    {
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    }
  ],
  "description": "What is it: Disables Windows Hello. \n Simeon Notes: Windows Hello is enabled by default on any Azure AD Joined devices. One of the effects of having Windows Hello is the users is prompted to create a PIN at logon, Simeon’s experience has found that the majority of business do not want this option turned on.",
  "windowsHelloForBusinessBlocked": true
}