{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Corporate Devices"
      }
    }
  ],
  "description": "Turns off Microsoft consumer specific experiences, such as Start suggestions, membership notifications, post-OOBE app install and redirect tiles.",
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "AllowWindowsConsumerFeatures",
      "isReadOnly": false,
      "omaUri": "./Vendor/MSFT/Policy/Config/Experience/AllowWindowsConsumerFeatures",
      "value": 0
    }
  ]
}