{
  "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "Baseline - Autopilot Devices - Self Deploying"
      }
    }
  ],
  "description": "**What does this do?**\n\nCreates an Intune autopilot profile for enrolling machines using the self-deploying method, which enables a device to be enrolled into your environment with little to no user interaction. Self-deployment mode comes with restrictions including that the device must have TPM 2.0, and it is not supported on virtual machines even if they have a virtual TPM. Devices in the Azure AD group 'Baseline - Autopilot Devices - Self Deploying' will be assigned this profile. \n\n**Why should you use this?**\n\nThis is most useful for devices that will be shared or used as a kiosk. If a device is going to be used by a single user it is best to use the user-driven method.\n\n**What is the end-user impact?**\n\nUser devices assigned to this profile can be configured using the self-deployment method.\n\n**Learn more**\n\n[Windows Autopilot Self-Deploying mode](https://docs.microsoft.com/en-us/mem/autopilot/self-deploying)",
  "deviceNameTemplate": "",
  "deviceType": "windowsPc",
  "enableWhiteGlove": false,
  "extractHardwareHash": true,
  "language": "en-US",
  "outOfBoxExperienceSettings": {
    "deviceUsageType": "shared",
    "hideEscapeLink": true,
    "hideEULA": true,
    "hidePrivacySettings": true,
    "skipKeyboardSelectionPage": true,
    "userType": "standard"
  }
}