{
  "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "BUILTIN - Autopilot Devices - User Driven"
      }
    }
  ],
  "description": "What is it: Creates an Intune autopilot profile for enrolling machines using the user-driven method. \n Simeon Notes: When a device is going to be used by a single user, the user-driven approach ideal. Devices in the Azure AD group 'BUILTIN - Autopilot Devices - User Driven' will be assigned this profile. \n Learn More: https://docs.microsoft.com/en-us/mem/autopilot/user-driven",
  "deviceNameTemplate": "",
  "deviceType": "windowsPc",
  "enableWhiteGlove": false,
  "extractHardwareHash": true,
  "language": "os-default",
  "outOfBoxExperienceSettings": {
    "deviceUsageType": "singleUser",
    "hideEscapeLink": true,
    "hideEULA": true,
    "hidePrivacySettings": true,
    "skipKeyboardSelectionPage": false,
    "userType": "standard"
  }
}