{
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "$description": "| What does this do? | **This policy is in Report Only mode. Before enabaling, all accounts should hvae completed MFA regisration. Consider excluding break glass accounts. This must be enabled to be compilant with Essential 8** Implements ACSC Essential Eight Maturity Level 2 & 3 multi-factor authentication requirements across all users. |\n| Why should you use this? | Ensures compliance with ACSC Essential Eight guidelines for higher-level MFA. |\n| What is the end-user impact? | All users included in the policy must use only the allowed combinations for MFA at this higher maturity level. |\n| Learn more | [ACSC Essential Eight](https://www.cyber.gov.au/resources-business-and-government/essential-cyber-security/essential-eight) |",
  "$friendlyName": "ACSC Essential Eight MFA - Maturity Level 2 & 3",
  "$name": "ACSC Essential Eight MFA - Maturity Level 2 & 3",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [],
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "authenticationStrength": {
      "id": "${urn:resource:MSGraph:Identity:ConditionalAccess:AuthenticationStrength:Policies/Essential 8 Maturity level 2,3?id}"
    },
    "builtInControls": [],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabledForReportingButNotEnforced"
}