{
  "$description": "| What does this do? | Require that users connect to M365 from a device that is managed using conditional access and is listed as compliant in Intune. The group Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations is excluded from this policy. Since this policy is so restrictive, it will be created in a report-only state. |\n| Why should you use this? | Only compliant, managed devices should be allowed to access corporate resources. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users will not be able to login to their account on devices not enrolled into Intune and in a “Compliant” state. |\n| Learn more | [Require a compliant device](https://learn.microsoft.com/en-us/azure/active-directory/conditional-access/howto-conditional-access-policy-compliant-device#create-a-conditional-access-policy) |",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "all"
    ],
    "platforms": {
      "excludePlatforms": [
        "android",
        "ios"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      ],
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "compliantDevice"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabledForReportingButNotEnforced",
  "$friendlyName": "Baseline - Require Managed Devices for Authentication"
}
