{
  "$description": "| What does this do? | Requires that users with privileged administrator roles authenticate using MFA. The baseline includes all users except those with the Azure AD role \"Directory Synchronization Accounts.\" |\n| Why should you use this? | If you want to protect your tenant by requiring MFA for accounts that have privileged access. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users with privileged access must authenticate using MFA. |\n| Learn more | [Protect your Microsoft 365 global administrator accounts](https://docs.microsoft.com/en-us/office365/enterprise/protect-your-global-administrator-accounts) |",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      ],
      "excludeRoles": [
        "${urn:resource:MSGraph:DirectoryRoles/Directory Synchronization Accounts?roleTemplateId}"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [
        "${urn:resource:MSGraph:DirectoryRoles/Application Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Application Developer?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Authentication Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Azure DevOps Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Azure Information Protection Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/B2C IEF Keyset Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/B2C IEF Policy Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Billing Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Cloud Application Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Cloud Device Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Compliance Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Compliance Data Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Conditional Access Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Customer LockBox Access Approver?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Desktop Analytics Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Directory Readers?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Directory Synchronization Accounts?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Dynamics 365 Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Exchange Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/External Identity Provider Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Fabric Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Global Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Global Reader?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Groups Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Guest Inviter?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Helpdesk Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Hybrid Identity Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Intune Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Kaizala Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/License Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Message Center Privacy Reader?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Message Center Reader?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Network Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Office Apps Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Password Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Power Platform Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Printer Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Printer Technician?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Privileged Authentication Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Privileged Role Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Reports Reader?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Search Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Search Editor?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Security Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Security Operator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Security Reader?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Service Support Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/SharePoint Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Skype for Business Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Teams Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Teams Communications Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Teams Communications Support Engineer?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Teams Communications Support Specialist?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/Teams Devices Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:DirectoryRoles/User Administrator?roleTemplateId}"
      ],
      "includeUsers": []
    }
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}