{
  "$description": "| What does this do? | Requires that users with privileged administrator roles authenticate using MFA. The baseline includes all users except those with the Azure AD role \"Directory Synchronization Accounts.\" |\n| Why should you use this? | If you want to protect your tenant by requiring MFA for accounts that have privileged access. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users with privileged access must authenticate using MFA. |\n| Learn more | [Protect your Microsoft 365 global administrator accounts](https://docs.microsoft.com/en-us/office365/enterprise/protect-your-global-administrator-accounts) |",
  "$friendlyName": "Baseline - Require MFA for Admins",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      ],
      "excludeRoles": [
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Directory Synchronization Accounts?roleTemplateId}"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Application Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Application Developer?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Authentication Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Azure DevOps Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Azure Information Protection Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/B2C IEF Keyset Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/B2C IEF Policy Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Billing Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Cloud Application Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Cloud Device Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Compliance Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Compliance Data Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Conditional Access Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Customer LockBox Access Approver?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Desktop Analytics Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Directory Readers?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Directory Synchronization Accounts?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Dynamics 365 Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Exchange Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/External Identity Provider Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Fabric Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Global Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Global Reader?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Groups Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Guest Inviter?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Helpdesk Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Hybrid Identity Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Intune Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Kaizala Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/License Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Message Center Privacy Reader?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Message Center Reader?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Network Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Office Apps Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Password Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Power Platform Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Printer Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Printer Technician?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Privileged Authentication Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Privileged Role Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Reports Reader?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Search Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Search Editor?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Security Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Security Operator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Security Reader?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Service Support Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/SharePoint Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Skype for Business Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Teams Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Teams Communications Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Teams Communications Support Engineer?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Teams Communications Support Specialist?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Teams Devices Administrator?roleTemplateId}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/User Administrator?roleTemplateId}"
      ],
      "includeUsers": []
    }
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}
