{
  "$description": "| What does this do? | Requires MFA when accessing the Azure management portal. |\n| Why should you use this? | Organizations use many Azure services and manage them from Azure Resource Manager.  To protect these privileged resources, Microsoft recommends requiring multifactor authentication for any user accessing these resources |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users accessing the Azure Portal, Azure PowerShell, or Azure CLI must authenticate using MFA. |\n| Learn more | [Require MFA for Azure Management](https://learn.microsoft.com/en-us/azure/active-directory/conditional-access/howto-conditional-access-policy-azure-management) |",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "${urn:resource:MSGraph:ServicePrincipals/Windows Azure Service Management API?appId}"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      ],
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}