{
  "$description": "| What does this do? | Enable Azure AD Identity Protection user risk policies |\n| Why should you use this? | Configures a policy to detect risky user accounts and force remediation actions. |\n| What is the end-user impact? | Compromised users will need to change password and complete MFA. |\n| Learn more | [Identity protection MFA policy](https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/howto-identity-protection-configure-mfa-policy) |",
  "$friendlyName": "Baseline - Require Password Change for High-risk Users",
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [
      "high"
    ],
    "users": {
      "excludeGroups": [],
      "excludeRoles": [],
      "excludeUsers": [
        "${urn:resource:MSGraph:Users/break-glass@${ResourceContext:TenantDomainName}?id}",
        "${urn:resource:MSGraph:Users/emergency-access@${ResourceContext:TenantDomainName}?id}"
      ],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "mfa",
      "passwordChange"
    ],
    "customAuthenticationFactors": [],
    "operator": "AND",
    "termsOfUse": []
  },
  "sessionControls": {
    "signInFrequency": {
      "authenticationType": "primaryAndSecondaryAuthentication",
      "frequencyInterval": "everyTime",
      "isEnabled": true
    }
  },
  "state": "enabled"
}