{
  "$description": "| What does this do? | Requires MFA to enroll a device into Microsoft Intune. |\n| Why should you use this? | If you require MFA, employees and students wanting to enroll devices must first authenticate with a second device and two forms of credentials. We do not want unauthorized users joining devices to our network.  |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users must fulfill an MFA prompt before enrolling a device into Intune. |\n| Learn more | [Confgiure Intune to Require MFA](https://learn.microsoft.com/en-us/MEM/intune/enrollment/multi-factor-authentication#configure-intune-to-require-multifactor-authentication-at-device-enrollment) |",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "${urn:resource:MSGraph:ServicePrincipals/4ebce55-015a-49b5-a083-c84d1797ae8c?appId}",
       "${urn:resource:MSGraph:ServicePrincipals/0000000a-0000-0000-c000-000000000000?appId}"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      ],
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}