{
  "$description": "| What does this do? | **This policy is in Report Only mode. Before enabaling, consider excluding break glass accounts and account for any guest users in the tenant. This must be enabled to be compilant** Requires a compliant device to register additional security methods. |\n| Why should you use this? | Enforcing this requirement will both reduce the attack surface for fake registrations and ensure that legitimate users register using trusted devices  |\n| What is the end-user impact? | Users must use a compliant device to access Microsoft resources. |\n| Learn more | [Require device to be marked as compliant (Conditional Access)](https://learn.microsoft.com/en-us/entra/identity/conditional-access/concept-conditional-access-grant#require-device-to-be-marked-as-compliant) [Hybrid Azure AD join](https://learn.microsoft.com/en-us/entra/identity/devices/concept-hybrid-join) [Intune device enrollment deployment guide](https://learn.microsoft.com/en-us/mem/intune/fundamentals/deployment-guide-enrollment) |",
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "$friendlyName": "Baseline - Require Managed Device to Register Security Information",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [
        "urn:user:registersecurityinfo"
      ]
    },
    "clientAppTypes": [
      "all"
    ],
    "platforms": {
      "excludePlatforms": [
        "android",
        "iOS",
        "linux",
        "macOS"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [],
      "excludeRoles": [],
      "excludeUsers": [
        "${urn:resource:MSGraph:Users/admin@${ResourceContext:TenantDomainName}?id}"
      ],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice",
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabledForReportingButNotEnforced"
}