{
  "$description": "| What does this do? | Blocks platforms other than iOS and Android from devices that are off-network and not Intune-managed. This policy does not apply to external/guest users, users in the Azure AD group \"Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations\" or users with the role \"Global Administrator\" or \"Directory Synchronization Accounts.\" The policy excludes the applications Microsoft Intune and Microsoft Intune Enrollment. |\n| Why should you use this? | This policy helps protect your data by blocking authentication from untrusted devices and locations. Application protection policies on iOS and Android protect data and provide DLP. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users are restricted to iOS and Android platforms for authenticating devices when connecting from untrusted devices and locations. |\n| Learn more | [How you can protect app data](https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy) |",
  "conditions": {
    "applications": {
      "excludeApplications": [
        "${urn:resource:MSGraph:ServicePrincipals/d4ebce55-015a-49b5-a083-c84d1797ae8c?appId}",
       "${urn:resource:MSGraph:ServicePrincipals/0000000a-0000-0000-c000-000000000000?appId}"
      ],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "deviceFilter": {
        "mode": "exclude",
        "rule": "device.trustType -eq \"ServerAD\" -or device.isCompliant -eq True"
      },
      "excludeDevices": [],
      "excludeDeviceStates": [],
      "includeDevices": []
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [
        "android",
        "ios"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      ],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
          "membershipKind": "all"
        },
        "guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider"
      },
      "excludeRoles": [
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Directory Synchronization Accounts?id}",
        "${urn:resource:MSGraph:RoleManagement:Directory:RoleDefinitions/Global Administrator?id}"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}