{
  "@odata.type": "#microsoft.graph.smsAuthenticationMethodConfiguration",
  "$friendlyName": "sms",
  "excludeTargets": [],
  "includeTargets": [
    {
      "@odata.type": "#microsoft.graph.authenticationMethodTarget",
      "id": "all_users",
      "isRegistrationRequired": false,
      "targetType": "group"
    }
  ],
  "state": "disabled"
}