{
  "@odata.type": "#microsoft.graph.temporaryAccessPassAuthenticationMethodConfiguration",
  "$friendlyName": "temporaryAccessPass",
  "defaultLength": 8,
  "defaultLifetimeInMinutes": 60,
  "excludeTargets": [],
  "includeTargets": [
    {
      "@odata.type": "#microsoft.graph.authenticationMethodTarget",
      "id": "all_users",
      "isRegistrationRequired": false,
      "targetType": "group"
    }
  ],
  "isUsableOnce": false,
  "maximumLifetimeInMinutes": 480,
  "minimumLifetimeInMinutes": 60,
  "state": "enabled"
}