{
  "@odata.type": "#microsoft.graph.x509CertificateAuthenticationMethodConfiguration",
  "$description": "| What does this do? | Enables and configures certificate-based authentication for all users. |\n| Why should you use this? | Supports secure authentication using x509 digital certificates. |\n| What is the end-user impact? | Users can use certificates to authenticate to Microsoft services. |",
  "$friendlyName": "x509Certificate",
  "authenticationModeConfiguration": {
    "rules": [],
    "x509CertificateAuthenticationDefaultMode": "x509CertificateSingleFactor",
    "x509CertificateDefaultRequiredAffinityLevel": "low"
  },
  "certificateUserBindings": [
    {
      "priority": 1,
      "trustAffinityLevel": "low",
      "userProperty": "userPrincipalName",
      "x509CertificateField": "PrincipalName"
    },
    {
      "priority": 2,
      "trustAffinityLevel": "low",
      "userProperty": "userPrincipalName",
      "x509CertificateField": "RFC822Name"
    },
    {
      "priority": 3,
      "trustAffinityLevel": "high",
      "userProperty": "certificateUserIds",
      "x509CertificateField": "SubjectKeyIdentifier"
    }
  ],
  "excludeTargets": [],
  "includeTargets": [
    {
      "@odata.type": "#microsoft.graph.authenticationMethodTarget",
      "id": "all_users",
      "isRegistrationRequired": false,
      "targetType": "group"
    }
  ],
  "issuerHintsConfiguration": {
    "state": "disabled"
  },
  "state": "enabled"
}