{
  "$friendlyName": "Baseline - Configure Policy Managed Client Apps on Unmanaged iOS Devices",
  "$description": "| What does this do? | Configures the default behavior for application settings of managed applications on unmanaged iOS devices. The baseline expands the list of applications that are allowed by Intune and data loss protection policies. |\n| Why should you use this? | If you want to improve your users' iOS mobile experience by expanding the list of allowed applications. |\n| What is the end-user impact? |  If you want to expand the list of applications that can access organization data on iOS devices. |\n| Learn more | [Add app configuration policies for managed apps without device enrollment](https://docs.microsoft.com/en-us/mem/intune/apps/app-configuration-policies-managed-app) |",
  "appGroupType": "selectedPublicApps",
  "apps": [
    {
      "id": "com.adobe.acrobatdc.intune.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.adobe.acrobatdc.intune"
      },
      "version": "1195811135"
    },
    {
      "id": "com.adobe.adobe-reader.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.adobe.adobe-reader"
      },
      "version": "536130818"
    },
    {
      "id": "com.box.mdmios.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.box.mdmios"
      },
      "version": "-1220619900"
    },
    {
      "id": "com.microsoft.bing.halseyassistant.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.bing.halseyassistant"
      },
      "version": "-2071986606"
    },
    {
      "id": "com.microsoft.dynamics.invoice.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.dynamics.invoice"
      },
      "version": "1155697219"
    },
    {
      "id": "com.microsoft.dynamics.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.dynamics"
      },
      "version": "-1579857600"
    },
    {
      "id": "com.microsoft.dynamics.iphone.moca.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.dynamics.iphone.moca"
      },
      "version": "49011501"
    },
    {
      "id": "com.microsoft.intune.managedbrowser.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.intune.managedbrowser"
      },
      "version": "-1480721402"
    },
    {
      "id": "com.microsoft.lync2013.iphone.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.lync2013.iphone"
      },
      "version": "1849821213"
    },
    {
      "id": "com.microsoft.mobile.polymer.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.mobile.polymer"
      },
      "version": "1745532580"
    },
    {
      "id": "com.microsoft.msapps.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.msapps"
      },
      "version": "408162834"
    },
    {
      "id": "com.microsoft.msedge.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.msedge"
      },
      "version": "-2135752869"
    },
    {
      "id": "com.microsoft.office.excel.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.office.excel"
      },
      "version": "-1255026913"
    },
    {
      "id": "com.microsoft.office.outlook.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.office.outlook"
      },
      "version": "-518090279"
    },
    {
      "id": "com.microsoft.office.powerpoint.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.office.powerpoint"
      },
      "version": "-740777841"
    },
    {
      "id": "com.microsoft.office.word.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.office.word"
      },
      "version": "922692278"
    },
    {
      "id": "com.microsoft.office365booker.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.office365booker"
      },
      "version": "-169796186"
    },
    {
      "id": "com.microsoft.onenote.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.onenote"
      },
      "version": "107156768"
    },
    {
      "id": "com.microsoft.plannermobile.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.plannermobile"
      },
      "version": "-175532278"
    },
    {
      "id": "com.microsoft.powerbimobile.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.powerbimobile"
      },
      "version": "-91595494"
    },
    {
      "id": "com.microsoft.procsimo.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.procsimo"
      },
      "version": "-1388599138"
    },
    {
      "id": "com.microsoft.rms-sharing.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.rms-sharing"
      },
      "version": "-77957813"
    },
    {
      "id": "com.microsoft.sharepoint.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.sharepoint"
      },
      "version": "-585639021"
    },
    {
      "id": "com.microsoft.shiftr.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.shiftr"
      },
      "version": "894357160"
    },
    {
      "id": "com.microsoft.skydrive.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.skydrive"
      },
      "version": "-108719121"
    },
    {
      "id": "com.microsoft.skype.teams.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.skype.teams"
      },
      "version": "-1040529574"
    },
    {
      "id": "com.microsoft.stream.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.stream"
      },
      "version": "126860698"
    },
    {
      "id": "com.microsoft.to-do.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.to-do"
      },
      "version": "-292160221"
    },
    {
      "id": "com.microsoft.visio.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.visio"
      },
      "version": "-387333446"
    },
    {
      "id": "com.microsoft.workfolders.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.workfolders"
      },
      "version": "-337142390"
    },
    {
      "id": "com.printeron.printeron.microsoft.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.printeron.printeron.microsoft"
      },
      "version": "784543330"
    },
    {
      "id": "com.sharefile.mobile.intune.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.sharefile.mobile.intune"
      },
      "version": "579650864"
    },
    {
      "id": "com.veradocs.ios.appstore.intune.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.veradocs.ios.appstore.intune"
      },
      "version": "1753483651"
    },
    {
      "id": "nl.msi.ibabspro.it.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "nl.msi.ibabspro.it"
      },
      "version": "1238477955"
    },
    {
      "id": "nz.co.beweb.speakingemail.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "nz.co.beweb.speakingemail"
      },
      "version": "722248506"
    },
    {
      "id": "wefwef.ios",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "wefwef"
      },
      "version": "207428455"
    }
  ],
  "assignments": [
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?id}"
      }
    },
    {
      "source": "direct",
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Microsoft 365 Users?id}"
      }
    }
  ],
  "customSettings": [
    {
      "name": "com.microsoft.intune.mam.managedbrowser.AllowTransitionOnBlock",
      "value": "true"
    },
    {
      "name": "com.microsoft.intune.mam.managedbrowser.AppProxyRedirection",
      "value": "false"
    },
    {
      "name": "com.microsoft.intune.useEdge",
      "value": "true"
    },
    {
      "name": "com.microsoft.outlook.Contacts.LocalSyncEnabled.UserChangeAllowed",
      "value": "true"
    },
    {
      "name": "com.microsoft.outlook.Contacts.LocalSyncEnabled",
      "value": "true"
    },
    {
      "name": "com.microsoft.outlook.Mail.DefaultSignatureEnabled",
      "value": "false"
    },
    {
      "name": "com.microsoft.outlook.Mail.FocusedInbox",
      "value": "true"
    }
  ],
  "expand": "apps,assignments",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "settings": [],
  "targetedAppManagementLevels": "unspecified"
}
