{
  "$description": "| What does this do? | Configures Windows to set time zone automatically based on location. Also sets the default computer time zone based on public IP address, as some computers have issues using the Auto Time Zone Updater because of ISP or network restrictions. |\n| Why should you use this? | If you want to automatically set the time zone based on location. |\n| What is the end-user impact? | The time zone will be set automatically based on the device location. |\n| Learn more | N/A |",
  "$friendlyName": "Baseline - OS - Set-TimeZone",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?id}"
      }
    }
  ],
  "enforceSignatureCheck": false,
  "expand": "assignments",
  "fileName": "Baseline - OS - Set-TimeZone.ps1",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "runAs32Bit": false,
  "runAsAccount": "system",
  "scriptContent": "${urn:resource:MSGraph:DeviceManagement:DeviceManagementScripts/Baseline - OS - Set-TimeZone?$additionalContentFiles['scriptContent.ps1']}"
}
