{
  "$description": "| What does this do? | Adds the Authenticated Users group to the Remote Desktop Users group so any authenticated user can connect via Remote Desktop. A separate configuration (Baseline - OS - RDP Enabled) allows users in the \"Remote Desktop users' group to access devices remotely. |\n| Why should you use this? | If you want to allow users to connect remotely via Remote Desktop. |\n| What is the end-user impact? | Users may connect remotely via Remote Desktop. |\n| Learn more | N/A |",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
      }
    }
  ],
  "enforceSignatureCheck": false,
  "fileName": "Baseline - Security - Add-AuthenticatedUsersToRemoteDesktopUsers.ps1",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ],
  "runAs32Bit": true,
  "runAsAccount": "system"
}