{
  "$description": "| What does this do? | The baseline configures the IntuneManagementExtension to not delete installation logs from devices. |\n| Why should you use this? | If you want to have logs available to troubleshoot device management issues. |\n| What is the end-user impact? | Users will be able to view installation logs. |\n| Learn more | N/A |",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?$id}"
      }
    }
  ],
  "enforceSignatureCheck": false,
  "fileName": "Baseline - Management - Set-IntuneManagementExtensionConfiguration.ps1",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?$id}"
  ],
  "runAs32Bit": true,
  "runAsAccount": "system"
}