{
  "$description": "| What does this do? | Creates a local administrator account on Windows devices called \"devicelocaladmin\". This account password is set from the first three portions of the device's BitLocker recovery key (which can be viewed in the Azure portal) plus the letter \"X\" (e.g. 123456-123456-123456X) |\n| Why should you use this? | Administrators with permission to view the BitLocker recovery key will be able to log in to Windows devices using a local administrator account. |\n| What is the end-user impact? | N/A |\n| Learn more | [View BitLocker recovery keys](https://365adviser.com/azure/how-to-find-the-bitlocker-recovery-key-in-azure-ad) |",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?id}"
      }
    }
  ],
  "enforceSignatureCheck": false,
  "expand": "assignments",
  "fileName": "Baseline - Management - Set-LocalAdminPassword.ps1",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "runAs32Bit": false,
  "runAsAccount": "system",
  "scriptContent": "${urn:resource:MSGraph:DeviceManagement:DeviceManagementScripts/Baseline - Management - Set-LocalAdminPassword?$additionalContentFiles['scriptContent.ps1']}"
}