{
  "$description": "| What does this do? | Enables the Windows Task Scheduler to display history of task runs. The baseline enables this setting. It is disabled in Windows by default. |\n| Why should you use this? | This can help with troubleshooting scheduled tasks. |\n| What is the end-user impact? | N/A |\n| Learn more | [Enable Windows task scheduler history](https://medium.com/techygeekshome/enable-windows-task-scheduler-history-996a601a178c) |",
  "$friendlyName": "Baseline - OS - Enable-TaskSchedulerHistory",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "${urn:resource:MSGraph:Groups/Baseline - Corporate Devices?id}"
      }
    }
  ],
  "enforceSignatureCheck": false,
  "expand": "assignments",
  "fileName": "Baseline - OS - Enable-TaskSchedulerHistory.ps1",
  "roleScopeTagIds": [
    "${urn:resource:MSGraph:DeviceManagement:RoleScopeTags/Default?id}"
  ],
  "runAs32Bit": true,
  "runAsAccount": "system",
  "scriptContent": "${urn:resource:MSGraph:DeviceManagement:DeviceManagementScripts/Baseline - OS - Enable-TaskSchedulerHistory?$additionalContentFiles['scriptContent.ps1']}"
}
