{
  "$description": "| What does this do? | Blocks Exchange ActiveSync, which disables native iOS and Android mail clients. The baseline blocks Exchange Active sync for all users except those in the Azure AD group \"Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations.\" |\n| Why should you use this? | It is recommended to disable native mail applications since they do not provide the same level of security and functionality as Microsoft Outlook. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users cannot use native mail applications except if specifically allowed. |\n| Learn more | [Policy recommendations for securing email](https://docs.microsoft.com/en-us/microsoft-365/enterprise/secure-email-recommended-policies?view=o365-worldwide) |",
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "00000002-0000-0ff1-ce00-000000000000"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "exchangeActiveSync"
    ],
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "android",
        "iOS"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?$id}"
      ],
      "excludeRoles": [],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "approvedApplication"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}