{
  "conditions": {
    "applications": {
      "excludeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeApplications": [
        "All"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "excludeDeviceStates": [
        "Compliant",
        "DomainJoined"
      ],
      "includeDeviceStates": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "android",
        "iOS"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations"
      ],
      "excludeRoles": [
        "Company Administrator",
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "description": "| What does this do? | Allows only mobile applications (iOS and Android) that support application protection policies (e.g. Outlook, SharePoint, OneDrive, Excel) to connect from off-network and from unmanaged devices. The baseline assigns the policy to all users except those in the Azure AD group \"Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations.\" The policy is also assigned to all applications except those listed in the config property \"ResourceContext:AppsAllowedFromUntrustedLocations.\" These protection policies do not work from other device types. This policy works in conjunction with the policy \"Block Platforms Other than iOS or Android from Unmanaged Devices and Untrusted Locations\" to restrict non-iOS and Android platforms and unprotected applications. The policy excludes apps specified in \"AppsAllowedFromUntrustedLocations.\", which can be used to whitelist applications that do not support application protection policies. |\n| Why should you use this? | This policy helps protect your data. Application protection policies on iOS and Android protect data and provide DLP. |\n| What is the end-user impact? | Users may only use applications that support protection policies to access data from iOS and Android devices off-network. |\n| Learn more | [How you can protect app data](https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy) |",
  "grantControls": {
    "builtInControls": [
      "approvedApplication"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}