{
  "conditions": {
    "applications": {
      "excludeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeApplications": [
        "All"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "excludeDeviceStates": [
        "Compliant",
        "DomainJoined"
      ],
      "includeDeviceStates": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "android",
        "iOS"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations"
      ],
      "excludeRoles": [
        "Company Administrator",
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "description": "| What does this do? | Allows only mobile applications (iOS and Android) that support applications protection policies (e.g. Outlook, SharePoint, OneDrive, Excel) to connect from off-network. The baseline assigns the policy to all users except those in the Azure AD group 'Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations.' The policy is also assigned to all applications except those listed in the config property 'AppsAllowedFromUntrustedLocations.' These protection policies do not work from other device types. This policy works in conjunction with the policy 'Block Platforms Other than iOS or Android from Unmanaged Devices and Untrusted Locations' to restrict non-iOS and android platforms and unprotected applications. Intune-managed devices are still able to access data off network. |\n| Why should you use this? | This policy helps protect your data. Application protection policies on iOS and Android have been tested and verified to protect data. |\n| What is the end-user impact? | Users may only connect from off-network via iOS and Android devices. |\n| Learn more | [How you can protect app data](https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy) |",
  "grantControls": {
    "builtInControls": [
      "approvedApplication"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}