{
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [],
      "excludeRoles": [
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [
        "Billing Administrator",
        "Company Administrator",
        "Conditional Access Administrator",
        "Exchange Service Administrator",
        "Helpdesk Administrator",
        "Password Administrator",
        "Security Administrator",
        "SharePoint Service Administrator",
        "User Account Administrator"
      ],
      "includeUsers": []
    }
  },
  "description": "| What does this do? | Requires that users with privileged administrator roles authenticate using MFA. The baseline includes all users except those with the Azure AD role \"Directory Synchronization Accounts.\" |\n| Why should you use this? | If you want to further protect your tenant by requiring MFA for accounts that have privileged access. |\n| What is the end-user impact? | Users with privileged access must authenticate using MFA for each log in. |\n| Learn more | [Protect your Microsoft 365 global administrator accounts](https://docs.microsoft.com/en-us/office365/enterprise/protect-your-global-administrator-accounts) |",
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}