{
  "conditions": {
    "applications": {
      "excludeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "deviceFilter": null,
      "excludeDevices": [
        "Compliant",
        "DomainJoined"
      ],
      "includeDevices": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [
        "android",
        "iOS"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?$id}"
      ],
      "excludeRoles": [
        "62e90394-69f5-4237-9190-012177145e10",
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "excludeUsers": [
        "GuestsOrExternalUsers"
      ],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}