{
    "$description": "| What does this do? | Requries users to fulfill an MFA prompt before registering a device to Azure AD. |\n| Why should you use this? | It is recommended to enforce MFA before a user can register or join their device to Azure AD. This ensures that compromised accounts cannot be used to add rogue devices to Azure Active Directory |\n| What is the end-user impact? | <span style='color: yellow'>Medium Impact.</span> Users will get prompted with MFA when trying to register or join devices to Azure Active Directory. This could be through the out-of-box experience, users signing in via the company portal app, or users registering their devices through the account settings. |\n| Learn more | [Create Risk Policies](https://learn.microsoft.com/en-us/azure/active-directory/conditional-access/howto-conditional-access-policy-risk) |",
    "conditions": {
      "applications": {
        "excludeApplications": [],
        "includeApplications": [
        ],
        "includeAuthenticationContextClassReferences": [],
        "includeUserActions": [
            "urn:user:registerdevice"
        ]
      },
      "clientAppTypes": [
        "all"
      ],
      "platforms": {
        "excludePlatforms": [],
        "includePlatforms": [
        ]
      },
      "servicePrincipalRiskLevels": null,
      "signInRiskLevels": [
      ],
      "userRiskLevels": [

      ],
      "users": {
        "excludeGroups": [
        ],
        "excludeRoles": [],
        "excludeUsers": [],
        "includeGroups": [],
        "includeRoles": [],
        "includeUsers": [
          "All"
        ]
      }
    },
    "grantControls": {
      "builtInControls": [
        "mfa"
      ],
      "customAuthenticationFactors": [],
      "operator": "OR",
      "termsOfUse": []
    },
    "state": "enabled"
  }