{
    "$description": "| What does this do? | Sign-ins detected as high risk are to be blocked via Conditional Access. |\n| Why should you use this? | Azure AD Identity Protection uses various signals to detect the risk level for each sign-in. High risk sign-ins should not be blocked until further investigation. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Once a respective conditional access policy is implemented, if a high-risk user attempts to login, the user will receive an error message with instructions to contact the administrator to re-enable their access |\n| Learn more | [Create Risk Policies](https://learn.microsoft.com/en-us/azure/active-directory/conditional-access/howto-conditional-access-policy-risk) |",
    "conditions": {
      "applications": {
        "excludeApplications": [],
        "includeApplications": [
          "All"
        ],
        "includeAuthenticationContextClassReferences": [],
        "includeUserActions": []
      },
      "clientAppTypes": [
        "all"
      ],
      "platforms": {
        "excludePlatforms": [],
        "includePlatforms": [
        ]
      },
      "servicePrincipalRiskLevels": null,
      "signInRiskLevels": [
        "high"
      ],
      "userRiskLevels": [

      ],
      "users": {
        "excludeGroups": [
            "${urn:resource:MSGraph:Groups/Emergency Access?$id}"
        ],
        "excludeRoles": [],
        "excludeUsers": [],
        "includeGroups": [],
        "includeRoles": [],
        "includeUsers": [
          "All"
        ]
      }
    },
    "grantControls": {
      "builtInControls": [
        "block"
      ],
      "customAuthenticationFactors": [],
      "operator": "OR",
      "termsOfUse": []
    },
    "state": "enabled"
  }