{
  "$description": "| What does this do? | Allows only mobile applications (iOS and Android) that support application protection policies (e.g. Outlook, SharePoint, OneDrive, Excel) to connect from off-network and from unmanaged devices. This policy does not apply to external/guest users, users in the Azure AD group \"Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations\" or users with the role \"Global Administrator\" or \"Directory Synchronization Accounts.\" The policy is also assigned to all applications except those listed in the config property \"ResourceContext:AppsAllowedFromUntrustedLocations.\" These protection policies do not work from other device types. This policy works in conjunction with the policy \"Block Platforms Other than iOS or Android from Unmanaged Devices and Untrusted Locations\" to restrict non-iOS and Android platforms and unprotected applications. The policy excludes apps specified in \"AppsAllowedFromUntrustedLocations.\", which can be used to whitelist applications that do not support application protection policies. |\n| Why should you use this? | This policy helps protect your data. Application protection policies on iOS and Android protect data and provide DLP. |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users may only use applications that support protection policies to access data from iOS and Android devices off-network. |\n| Learn more | [How you can protect app data](https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy) |",
  "conditions": {
    "applications": {
      "excludeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "excludeDevices": [
        "Compliant",
        "DomainJoined"
      ],
      "includeDevices": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "android",
        "iOS"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?$id}"
      ],
      "excludeRoles": [
        "62e90394-69f5-4237-9190-012177145e10",
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "excludeUsers": [
        "GuestsOrExternalUsers"
      ],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "approvedApplication"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}