{
    "$description": "| What does this do? | Requires MFA to enroll a device into Microsoft Intune. |\n| Why should you use this? | If you require MFA, employees and students wanting to enroll devices must first authenticate with a second device and two forms of credentials. We do not want unauthorized users joining devices to our network.  |\n| What is the end-user impact? | <span style='color: red'>High Impact.</span> Users must fulfill an MFA prompt before enrolling a device into Intune. |\n| Learn more | [Confgiure Intune to Require MFA](https://learn.microsoft.com/en-us/MEM/intune/enrollment/multi-factor-authentication#configure-intune-to-require-multifactor-authentication-at-device-enrollment) |",
    "conditions": {
      "applications": {
        "excludeApplications": [],
        "includeApplications": [
          "${urn:resource:MSGraph:ServicePrincipals/Microsoft Intune?$data.appId}"
        ],
        "includeAuthenticationContextClassReferences": [],
        "includeUserActions": []
      },
      "clientAppTypes": [
        "all"
      ],
      "servicePrincipalRiskLevels": [],
      "signInRiskLevels": [],
      "userRiskLevels": [],
      "users": {
        "excludeGroups": [
          "${urn:resource:MSGraph:Groups/Emergency Access?$id}"
        ],
        "excludeGuestsOrExternalUsers": null,
        "excludeRoles": [],
        "excludeUsers": [],
        "includeGroups": [],
        "includeGuestsOrExternalUsers": null,
        "includeRoles": [],
        "includeUsers": [
          "All"
        ]
      }
    },
    "grantControls": {
      "authenticationStrength": null,
      "builtInControls": [
        "mfa"
      ],
      "customAuthenticationFactors": [],
      "operator": "OR",
      "termsOfUse": []
    },
    "state": "enabled"
  }