{
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients",
      "other"
    ],
    "devices": {
      "deviceFilter": null,
      "excludeDevices": [],
      "includeDevices": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "windows"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "${urn:resource:MSGraph:Groups/Baseline - Device Enrollers?$id}",
        "${urn:resource:MSGraph:Groups/Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations?$id}"
      ],
      "excludeRoles": [
        "62e90394-69f5-4237-9190-012177145e10",
        "d29b2b05-8046-44ba-8758-1e26182fcf32"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "grantControls": {
    "builtInControls": [
      "compliantDevice"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}