{
  "conditions": {
    "applications": {
      "excludeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeApplications": [
        "All"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "excludeDeviceStates": [
        "Compliant",
        "DomainJoined"
      ],
      "includeDeviceStates": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [
        "android",
        "iOS"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations"
      ],
      "excludeRoles": [
        "Company Administrator",
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "description": "**What does this do?**\n\nBlocks platforms other than iOS and Android from devices that are off-network and not Intune-managed. The baseline assigns the policy to all users except those in the Azure AD group 'Baseline - Unrestricted Access From Unmanaged Devices And Untrusted Locations.' The policy also excludes applications listed in the config property 'AppsAllowedFromUntrustedLocations.' \n\n**Why should you use this?**\n\nThis policy helps protect your data by blocking authentication from untrusted devices and locations. Application protection policies on iOS and Android have been tested and verified to protect data.\n\n**What is the end-user impact?**\n\nUsers are restricted to iOS and Android platforms for authenticating devices when connecting from untrusted devices and locations.\n\n**Learn more**\n\n[How you can protect app data](https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy)",
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}