{
  "conditions": {
    "applications": {
      "excludeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeApplications": [
        "All"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "excludeDeviceStates": [
        "Compliant",
        "DomainJoined"
      ],
      "includeDeviceStates": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [
        "android",
        "iOS"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations"
      ],
      "excludeRoles": [
        "Company Administrator",
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "description": "What is it: Blocks platforms other than iOS and Android from authenticating from devices that are off network and not Intune managed. \n Simeon Notes: This policy helps protect your data. Application protection policies on iOS and Android have been tested and verified to protect data. Intune managed devices are still able to access data off network. Simeon's baseline assigns the policy to all users except those in the Azure AD group 'BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations'. The policy is also assigned to all applications except those listed in the config property 'AppsAllowedFromUntrustedLocations'. \n Learn More: https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy",
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}