{
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "other"
    ],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations"
      ],
      "excludeRoles": [
        "Company Administrator",
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "description": "What is it: Blocks legacy protocols (not Modern Authentication). \n Simeon Notes: Legacy protocols including POP, SMTP, IMAP, and MAPI can be used to bypass security controls in your environment. This policy does not apply to users in the Azure AD group ‘BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations’. \n Learn More: https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/block-legacy-authentication",
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}