{
  "conditions": {
    "applications": {
      "excludeApplications": {
        "$ref": "ResourceContext:AppsAllowedFromUntrustedLocations"
      },
      "includeApplications": [
        "All"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "devices": {
      "excludeDeviceStates": [
        "Compliant",
        "DomainJoined"
      ],
      "includeDeviceStates": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "android",
        "iOS"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations"
      ],
      "excludeRoles": [
        "Company Administrator",
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "description": "What is it: Allows only allowlisted mobile (iOS and Android) apps to connect from off-network. \n Simeon Notes: This policy helps protect your data. Application protection policies on iOS and Android have been tested and verified to protect data, these protection policies do not work from other device types. Intune managed devices are still able to access data off network. Simeon’s baseline assigns the policy to all users except those in the Azure AD group ‘BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations’. The policy is also assigned to all applications except those listed in the config property ‘AppsAllowedFromUntrustedLocations’.\n Learn More: https://docs.microsoft.com/en-us/mem/intune/apps/app-protection-policy",
  "grantControls": {
    "builtInControls": [
      "approvedApplication"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}