{
  "conditions": {
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "Microsoft Intune Enrollment"
      ],
      "includeUserActions": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients",
      "other"
    ],
    "devices": {
      "excludeDeviceStates": [],
      "includeDeviceStates": [
        "All"
      ]
    },
    "locations": {
      "excludeLocations": [],
      "includeLocations": [
        "All"
      ]
    },
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "windows"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeGroups": [
        "BUILTIN - Device Enrollers",
        "BUILTIN - Unrestricted Access From Unmanaged Devices And Untrusted Locations"
      ],
      "excludeRoles": [
        "Company Administrator",
        "Directory Synchronization Accounts"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeUsers": [
        "All"
      ]
    }
  },
  "description": "Requires that a device be registered for Autopilot in order to enroll in Intune. The BUILTIN - Device Enrollers group is excluded and can enroll devices without Autopilot.",
  "grantControls": {
    "builtInControls": [
      "compliantDevice"
    ],
    "customAuthenticationFactors": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "state": "enabled"
}