{
"@odata.type": "#microsoft.graph.deviceEnrollmentLimitConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "description": "What is it: The default Device Limit Restriction applied with the lowest priority to all users regardless of group membership. \n Learn More: https://docs.microsoft.com/en-us/mem/intune/enrollment/enrollment-restrictions-set#create-a-device-limit-restriction",
  "limit": 5,
  "priority": 0
}