{
"@odata.type": "#microsoft.graph.deviceEnrollmentLimitConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "description": "This is the default Device Limit Restriction applied with the lowest priority to all users regardless of group membership.",
  "limit": { "$ref": "ResourceContext:DefaultDeviceEnrollmentLimit" },
  "priority": 0
}