{
  "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration",
  "androidForWorkRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": false,
    "platformBlocked": true
  },
  "androidRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "Baseline - Device Enrollers"
      }
    }
  ],
  "description": "| What does this do? | The baseline allows users in the Azure AD group \"Baseline – Device Enrollers\" to enroll any Windows device, even if they have not been previously registered in Autopilot. This can be overridden by other configurations with a higher priority. |\n| Why should you use this? | If you want to allow certain users to register non-Autopilot registered devices. |\n| What is the end-user impact? | Only certain users will be able to enroll devices to Intune that are non-Autopilot registered. |\n| Learn more | [Set enrollment restrictions](https://docs.microsoft.com/en-us/mem/intune/enrollment/enrollment-restrictions-set) |",
  "iosRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "macOSRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "macRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "priority": 1,
  "windowsRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": false,
    "platformBlocked": false
  }
}
