{
  "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration",
  "androidForWorkRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": false,
    "platformBlocked": true
  },
  "androidRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "description": "| What does this do? | Restricts the type of device that can be enrolled. The baseline allows enrollment of all corporate devices and blocks all personal devices. This limit can be overridden by other configurations with a higher priority. |\n| Why should you use this? | If you want to ensure that only corporate devices are enrolled in Intune. |\n| What is the end-user impact? | Users will be restricted to enrolling corporate devices only in Intune. |\n| Learn more | [Create a device type restriction](https://docs.microsoft.com/en-us/mem/intune/enrollment/enrollment-restrictions-set#create-a-device-type-restriction) |",
  "iosRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "macOSRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "macRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "priority": 0,
  "windowsRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  }
}
