{
  "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration",
  "androidForWorkRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": false,
    "platformBlocked": true
  },
  "androidRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "description": "What is it: The default device type restriction applied with the lowest priority to all users regardless of group membership. \n Simeon Notes: Simeon’s baseline allows all corporate devices to be enrolled, but blocks all personally owned devices. \n Learn More: https://docs.microsoft.com/en-us/mem/intune/enrollment/enrollment-restrictions-set#create-a-device-type-restriction",
  "iosRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "macOSRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "macRestriction": {
    "blockedManufacturers": [],
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  },
  "priority": 0,
  "windowsRestriction": {
    "blockedManufacturers": [],
    "osMaximumVersion": "",
    "osMinimumVersion": "",
    "personalDeviceEnrollmentBlocked": true,
    "platformBlocked": false
  }
}
