{
  "$description": "| What does this do? | The baseline disables Windows Hello for Business. |\n| Why should you use this? | If you do not want users to be prompted to setup Windows Hello the first time they log into a device. |\n| What is the end-user impact? | Users will not be prompted to set up Windows Hello when they log in to a device for the first time. |\n| Learn more | [Windows Hello for Business](https://docs.microsoft.com/en-us/mem/intune/protect/identity-protection-windows-settings) |",
  "@odata.type": "#microsoft.graph.deviceEnrollmentWindowsHelloForBusinessConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "displayName": "All users and all devices",
  "enhancedBiometricsState": "enabled",
  "pinExpirationInDays": 41,
  "pinLowercaseCharactersUsage": "disallowed",
  "pinMaximumLength": 127,
  "pinMinimumLength": 6,
  "pinPreviousBlockCount": 5,
  "pinSpecialCharactersUsage": "disallowed",
  "pinUppercaseCharactersUsage": "disallowed",
  "priority": 0,
  "remotePassportEnabled": true,
  "securityDeviceRequired": true,
  "securityKeyForSignIn": "notConfigured",
  "state": "disabled",
  "unlockWithBiometricsEnabled": true
}