{
"@odata.type": "#microsoft.graph.deviceEnrollmentLimitConfiguration",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "description": "#### **What does this do?**\n\nLimits the default number of devices that a single user can enroll. The baseline sets this limit to 5, however it can be overwritten by other configurations with a higher priority.\n\n#### **Why should you use this?**\n\nIf you want to ensure that no more than 5 devices are enrolled by a single user to prevent enrollment of unwanted devices. \n\n#### **What is the end-user impact?**\n\nUsers will be limited to enrolling 5 devices.\n\n#### **Learn more**\n\n[Create a device limit restriction](https://docs.microsoft.com/en-us/mem/intune/enrollment/enrollment-restrictions-set#create-a-device-limit-restriction)",
  "limit": 5,
  "priority": 0
}