{
  "@odata.type": "#microsoft.graph.deviceEnrollmentLimitConfiguration",
  "$description": "| What does this do? | This is the default Device Limit Restriction applied with the lowest priority to all users regardless of group membership. |",
  "deviceEnrollmentConfigurationType": "limit",
  "displayName": "All users and all devices",
  "expand": "assignments",
  "limit": 5,
  "priority": 0,
  "roleScopeTagIds": []
}