{
  "@odata.type": "#microsoft.graph.windows10EnrollmentCompletionPageConfiguration",
  "allowDeviceResetOnInstallFailure": false,
  "allowDeviceUseOnInstallFailure": false,
  "allowLogCollectionOnInstallFailure": true,
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "blockDeviceSetupRetryByUser": true,
  "customErrorMessage": "",
  "description": "**What does this do?**\nConfigures the page that is displayed to users while a device enrollment is in progress. The baseline allows the user to select the 'Continue Anyway' option as soon as it is available and times out after 40 minutes.\n\n**Why should you use this?**\nIf you want to allow users to click 'Continue Anyway' during the app installation phase of enrollment or when a single configuration in the enrollment process fails and you do not want users to get stuck indefinitely on the enrollment screen.\n\n**What is the end-user impact?**\nUsers will be able to click 'Continue Anyway' when device enrollment enters the Device Enrollment phase as well as when a single configuration in the enrollment process fails.\n\n**Learn more**\n[Set up the Enrollment Status Page](https://docs.microsoft.com/en-us/mem/intune/enrollment/windows-enrollment-status)",
  "disableUserStatusTrackingAfterFirstUser": false,
  "installProgressTimeoutInMinutes": 40,
  "priority": 0,
  "selectedMobileAppIds": [],
  "showInstallationProgress": true,
  "trackInstallProgressForAutopilotOnly": false
}