{
  "@odata.type": "#microsoft.graph.windows10EnrollmentCompletionPageConfiguration",
  "allowDeviceResetOnInstallFailure": false,
  "allowDeviceUseOnInstallFailure": false,
  "allowLogCollectionOnInstallFailure": true,
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "blockDeviceSetupRetryByUser": true,
  "customErrorMessage": "",
  "description": "This is the default enrollment status screen configuration applied with the lowest priority to all users and all devices regardless of group membership.",
  "disableUserStatusTrackingAfterFirstUser": false,
  "installProgressTimeoutInMinutes": 40,
  "priority": 0,
  "selectedMobileAppIds": [],
  "showInstallationProgress": true,
  "trackInstallProgressForAutopilotOnly": false
}