{
  "@odata.type": "#microsoft.graph.deviceEnrollmentWindowsHelloForBusinessConfiguration",
  "$description": "This is the default Windows Hello for Business configuration applied with the lowest priority to all users regardless of group membership.",
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "displayName": "All users and all devices",
  "enhancedBiometricsState": "enabled",
  "pinExpirationInDays": 41,
  "pinLowercaseCharactersUsage": "disallowed",
  "pinMaximumLength": 127,
  "pinMinimumLength": 6,
  "pinPreviousBlockCount": 5,
  "pinSpecialCharactersUsage": "disallowed",
  "pinUppercaseCharactersUsage": "disallowed",
  "priority": 0,
  "remotePassportEnabled": true,
  "securityDeviceRequired": true,
  "securityKeyForSignIn": "notConfigured",
  "state": "disabled",
  "unlockWithBiometricsEnabled": true
}