{
  "@odata.type": "#microsoft.graph.windows10EnrollmentCompletionPageConfiguration",
  "allowDeviceResetOnInstallFailure": false,
  "allowDeviceUseOnInstallFailure": false,
  "allowLogCollectionOnInstallFailure": true,
  "assignments": [
    {
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ],
  "blockDeviceSetupRetryByUser": true,
  "customErrorMessage": "",
  "description": "What is it: The default Intune enrollment status page configuration applied with the lowest priority to all users and all devices regardless of group membership. \n Simeon Notes: The enrollment status page is a visual queue to users of the device enrollment progress. Simeon’s baseline allows the user to select the ‘Continue Anyway’ option as soon as it is available and times out after 40 minutes. \n Learn More: https://docs.microsoft.com/en-us/mem/intune/enrollment/windows-enrollment-status",
  "disableUserStatusTrackingAfterFirstUser": false,
  "installProgressTimeoutInMinutes": 40,
  "priority": 0,
  "selectedMobileAppIds": [],
  "showInstallationProgress": true,
  "trackInstallProgressForAutopilotOnly": false
}